{"version":"https://jsonfeed.org/version/1.1","title":"Game Boy Essentials","description":"A project to review and talk about the essential games you should play on Game Boy to understand its appeal and its success.","home_page_url":"https://gameboyessentials.com","feed_url":"https://gameboyessentials.com/feed.json","icon":"https://gameboyessentials.com/apple-touch-icon.png","favicon":"https://gameboyessentials.com/apple-touch-icon.png","items":[{"id":"cgb-bmge","date_published":"2024-06-23T00:00:00-05:00","url":"https://gameboyessentials.com/articles/cgb-bmge","title":"Metal Gear: Ghost Babel","image":"/assets/cgb-bmge/cgb-bmge-start.png","banner-image":"/assets/cgb-bmge/cgb-bmge-start-social-share-card.png","content_html":"<h1 id=\"metal-gear-ghost-babel\">Metal Gear: Ghost Babel</h1>\n\n<ul>\n  <li>Japanese release in April 2000</li>\n  <li>North American release in April 2000</li>\n  <li>European release in May 2000</li>\n  <li>Published by Konami</li>\n  <li>Developed by TOSE</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-1.jpg\" width=\"640\" height=\"650\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">It’s such a clash to have the intricate artwork of a mature stealth title sitting next to the Technicolor smorgasbord logo of the Game Boy Color. It feels like Konami was getting away with murder. Like this game shouldn’t be on Game Boy Color.</figcaption></figure>\n\n<h2 id=\"portable-espionage-action\">Portable Espionage Action</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>I’ve spent my whole formative years watching the disappointing sequels to ’80s movies without having seen the first one.</p>\n<ul>\n  <li>I’ve seen <em>Ghostbusters 2</em> before the first one.</li>\n  <li><em>Alien 3</em> was my first Alien movie.</li>\n  <li>Same thing for <em>Indiana Jones and the Last Crusade</em>, although that’s the best one.</li>\n  <li><em>Robocop 2</em> was my introduction to the best cop in Detroit.</li>\n  <li>My first <em>Superman</em> was <em>Superman IV</em>.</li>\n  <li><em>City Slickers II: The Legend of Curly’s Gold</em> was my first Billy Crystal movie.</li>\n  <li>I only ever saw <em>Coccoon: The Return</em>, never the original.</li>\n  <li>I managed to see Disney’s nightmarish <em>Return to Oz</em> before I saw the classic Judy Garland movie.</li>\n  <li><em>Bill and Ted 2</em> was the only one of the two I’d seen until I saw the first one much later.</li>\n  <li>I loved the craziness and meta references of <em>Gremlins 2</em> without the need to see the original.</li>\n  <li>Finally, like most of my friends I saw <em>Spaceballs</em> before I saw any <em>Star Wars</em> movie. I have to admit that the transformation of <em>Spaceball One</em> into <em>Mega Maid</em> was more impressive to me than any special effects in the first three <em>Star Wars</em>.</li>\n</ul>\n\n<p>Which brings us to <em>Metal Gear: Ghost Babel</em>. I played the Game Boy Color game before I ever touched the PlayStation classic. Once again I enjoyed the follow-up first.</p>\n\n<p>Before we move on, we need to clarify nomenclature. Upon its release outside Japan, the Game Boy Color title discussed here was called <em>Metal Gear Solid</em>. That being <strong>also</strong> the name of the 1998 PlayStation game, it would be unwieldy to constantly have to explain which of the two games I’m talking about. For this reason, I will refer to the Game Boy Color title by its original Japanese name instead: <em>Metal Gear: Ghost Babel</em>. It’s a nice name and a reference to the Game Boy. <em>MG: <strong>GB</strong></em>. Get it?</p>\n\n<h2 id=\"excitement\">Excitement</h2>\n\n<p>Back in the late ’90s I did not have a PlayStation but still wanted to play <em>Metal Gear Solid</em>. I was supremely interested; there was this video game that was supposedly as good as a movie! Of course, I had no idea back then that this was all marketing. <em>Metal Gear Solid</em> pretends to be a movie but is nothing like the serious films it tries to replicate. Hideo Kojima desperately wants to make games that are structured like serious spy thrillers, but he still writes soapy anime for edgy teenagers.</p>\n\n<figure class=\"figure figure_pixel\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-3.png\" width=\"1280\" height=\"720\" alt=\"Screenshot\" /><figcaption class=\"figure_figcaption\">A Hind D?</figcaption></figure>\n\n<p>When Konami announced they were making a <em>Metal Gear</em> game for Game Boy Color, I was immediately interested. Initial images were very promising:</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-4.png\" width=\"320\" height=\"288\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-5.png\" width=\"212\" height=\"193\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-6.png\" width=\"286\" height=\"257\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>The people at Konami were not proposing strange gameplay mechanics that had very little to do with <em>Metal Gear Solid</em>. Many franchises coming to Game Boy would severely change their gameplay to fit the confines of the small console. <em>Ultima</em>, <em>Turok</em>, <em>Resident Evil</em>, <em>Perfect Dark</em>. Those are all franchises that drastically changed the gameplay for which they were known when they came to Game Boy. But here they were making a legitimate <em>Metal Gear</em> title. It even featured the radar system in the top right corner of the screen. That thing is really small, but you do use it all the time!</p>\n\n<p>It also told its story through cutscenes, and to help you understand the convoluted story of <em>Metal Gear: Ghost Babel</em>, I made a chart that covers the games’ story and their development relationships.</p>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-7.png\" width=\"2016\" height=\"1944\" alt=\"Boxart\" /></figure>\n\n<p>When the game came out in March 2000, I have to remind you I pirated the game. In 2000, GBC emulators were good enough to play new releases as soon as someone dumped the ROM online. There were some games that did not work properly back then, which I talked about in my <a href=\"/articles/cgb-bt5e\"><em>Toy Story Racer</em> article</a>. I even already told the story of my experience with <em>Metal Gear: Ghost Babel</em>. Let me tell it again. The first elevator of the game, encountered on the fourth mission, failed to move me to the next section of the facility. The second I pressed the elevator’s button, I was stuck in that elevator forever. In technical terms, I was softlocked. I could still move Solid Snake within the elevator, but I could never leave. I do not know if it was a bug or a voluntary anti-piracy measure. It would <a href=\"https://new.tcrf.net/Metal_Gear_Solid_(Game_Boy_Color)\">appear that the game indeed has code to lock up emulators on the title screen</a> and I wouldn’t put it past the developers at TOSE to include piracy counter-measures later in the game. I’m not competent enough to test my theory, but keep in mind, dear reader, that modern emulators are now indistinguishable from real hardware. No anti-piracy code can get triggered anymore.</p>\n\n<p>It was very frustrating to hit a wall like that, especially since I played through the game three times to verify I was really stuck; twice on the same emulator, and a third time with another emulator that also softlocked. Even though I was getting tired of repeating the early parts of the story, I caved and bought the game. I had to, I was hooked. I had played the equivalent of a demo and was now convinced to buy it.</p>\n\n<h2 id=\"the-development-structure\">The Development Structure</h2>\n\n<p>We cannot talk about <em>Metal Gear</em> without talking about Hideo Kojima at some point. The dude is synonymous with those games because he’s the main creator of the first game, he’s the most important voice in their development, but he’s far from the only one. Case in point, the director of <em>Metal Gear: Ghost Babel</em> is Shinta Nojiri. Hideo Kojima was only a supervisor.</p>\n\n<figure class=\"figure figure_art float left\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-8.jpg\" width=\"253\" height=\"302\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">Shinta Nojiri in a bathtub for some reason.</figcaption></figure>\n\n<p>Shinta Nojiri was fairly new within Konami, having only worked on the PlayStation port of <em>Policenauts</em>. After that game, there’s a very conspicuous gap in his resume before he worked on <em>Metal Gear: Ghost Babel</em>. I think he might have worked uncredited on <em>Metal Gear Solid</em> as a sort of fixer. Someone who comes in to help complete a project, usually accompanied with ungodly amounts of crunch. It’s conjecture on my part, but it would help explain why this very young inexperienced developer was then chosen to direct <em>Ghost Babel</em>. Finally, the game was developed with the help of TOSE. Just to jog your memory, they are a shadowy Japanese company that works as a secret contractor, often even as a subcontractor. They’re a large company, responsible for the development of many games and neither the company nor their employees receive credit for their work. The stories we hear about their development structure is that you send them as much design elements as possible and they finish the game on time and on budget, without an iota of effort above that. They are not a studio that goes beyond what is requested.</p>\n\n<p>With the development of <em>Metal Gear: Ghost Babel</em>, a different approach was taken. <a href=\"https://hg101.kontek.net/metalgear/shintanojiri.htm\">Shinta Nojiri actually moved from Tokyo to Kyoto and was physically embedded within the offices of TOSE</a>. It’s the first time I hear of a developer physically moving to work with TOSE. It obviously helped to bring the game to fruition, but Nojiri was the only Konami developer working directly with TOSE. I think the game’s flaws exist because he was the only person from Konami supervising the work. There was only so much he could do to bring the tender love and care a game of this scope needs. Case in point, the level design.</p>\n\n<h2 id=\"level-design-makes-or-breaks-a-classic\">Level Design Makes or Breaks a Classic</h2>\n\n<figure class=\"figure figure_gb left\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-9.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>I used to hold <em>Metal Gear: Ghost Babel</em> in very high regard. I had played it young, and loved it immensely, as my first stealth action experience. Replaying it for this article, I have to tamper my reverence due to its level design, which left me cold upon this replay. The level design in <em>MG:GB</em> is messy.</p>\n\n<p>It starts with the big picture. The game is divided in chapters. You cannot go back to previous sections of Fortress Galuade unless that’s what happens in the chapter. A game divided that way is not a design problem, but the game only saves at a couple of discrete points within each chapter. Usually, that’s after a story event. So if you save in the second-to-last room before a boss and reload the game later, you’ll be put back at the last story point instead. That might be halfway through the level, forcing you to replay a large section of the game. I wouldn’t even consider this a problem on PlayStation, but on a portable system it’s not fun to lose a ton of progress whenever you save and quit. I presume that game is divided that way to simplify the development structure, with the problem of lost progress due to a limited save system seen as a necessary compromise.</p>\n\n<p>Now we can go into the design of each level itself. Every room, taken in isolation, is okay. Some rooms only exist to enhance gameplay, but I can forgive those rooms. It’s how each and every room connects with one another that makes no sense. If you enter a building and explore different floors of that structure, the size is different from floor to floor. Elevators are placed where it makes gameplay sense, not architectural sense. Security rooms, full of traps and hazards, are placed between two corridors, protecting the entrance of nothing of value. You might think this has no impact on gameplay, but with a game focused on exploring bases to stealthily accomplish nebulous objectives, it’s important to understand the layout of your environment. It’s the game’s greatest flaw, and I think the level design problems are due to TOSE staff designing the levels themselves. It looks like something that was made quickly with the tiles they had, without a lot of attention paid to the players’ sense of space. Here’s a great example: the power plant mission.</p>\n\n<p>You have to find four structural pillars inside a power plant, and put C4 on them. You do that because you intend to collapse the whole building to cut the power to Metal Gear. It’s an inventive objective, made frustrating by the nonsensical floor plan of the power plant. The layout does not make sense, so finding the pillars turns into exploring every room from corner to corner to make sure you haven’t missed one. You cannot simply go to the four corners of the map to logically find the pillars. The dreaded box factory is another potent example. It could be made more fun if the relationships between the conveyor belt exits and the lower floors made more sense. Instead, you’re dealing with a building without logic. That makes the game’s worst level even more frustrating.</p>\n\n<p>The whole game is strewn with those little paper cuts. You’ll often find dead ends with no usage whatsoever in a level. That’s commendable since it could add realism (dead ends without a clear purpose exist in real life after all) but in this case it doesn’t work. Some of the connections between areas are visually confusing. In the second level, you have to find a side outcropping of a building to reach a back entrance. It does not look like there’s an access hatch there.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-10.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">The outcropping in question.</figcaption></figure>\n\n<p>I think there are issues with readability because of the colour limits of the Game Boy Color. They can’t always use a different shade to indicate a different element. When you get in the sewer, there are puddles of water on the ground. So far so good. Some puddles look awesome. Sue me, I love little details like that. Other puddles are far more difficult to visually understand.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-11.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">This puddle looks like a hole in the ground you should fall through.</figcaption></figure>\n\n<p>Often, you can’t make sense of the areas you’re looking at. I think they knew about the problem, since they always introduce a new area without enemies or challenge so you can figure out your environment without stress. On the other hand, the game features thermal goggles that work during the whole game. For a 3D game with an engine that allows post-processing, it’s trivial to implement. But we’re talking about sprites and tiles here. This meant that every single tile in the game had to be drawn twice, just so you can use the goggles anywhere you want. It’s incredible attention to detail that I’m surprised to find in this game.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-12.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">Most of the game can be played this way.</figcaption></figure>\n\n<h2 id=\"damn-boxes\">Damn Boxes</h2>\n\n<p>I could not talk about this game without talking about one despicable level: the box factory.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-13.jpg\" width=\"640\" height=\"480\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">Just like in <em>The Simpsons</em>, the box factory is boring as shit.</figcaption></figure>\n\n<p>In the middle of the game, you’re sent to this building with conveyor belts that move boxes according to their colour. You have to hide inside Solid Snake’s famous box disguise and slowly wait on the conveyor belts to fetch other coloured boxes. Those boxes then allow you to go through different directions in the conveyor belts to find more boxes and ultimately the exit. Keep in mind that you can change your boxes’ colour when on the conveyor belt, meaning you have to discover paths by constantly switching between three coloured boxes.</p>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-14.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>When I say it like that, it doesn’t sound too bad. The problem is the execution. The colour sorting machines are too far apart, meaning you often have to go through two screens before you come to another colour change. The conveyor belt layout is confusing, centred around a circle around the start without a visible destination. There is no logical connection between the conveyor belts and the segments on foot. You exit the belts in places that make no sense at all compared to your belt position. And finally, it’s slow. You move slowly, with a repetitive music to boot, so everything in that damn factory takes forever. It takes so long, and makes so little sense, you get bored and just want it over. I presume many players abandon the game at this point. I very nearly did myself. If not for the fact that I played this game in the 2000s, when I had little income and needed to justify the money I spent, I would have stopped this game right there.</p>\n\n<p>So look up the solution online. Do not hesitate. The box factory does not deserve your attention. Look up a walkthrough and just get it over with. It’s a black mark on an otherwise very fun game. If you want to find beautiful level design that showcases the capabilities of the game, you have to play the VR Training.</p>\n\n<h2 id=\"vr\">VR</h2>\n\n<p>The VR challenges redeem the level design for me. Yeah, the story levels aren’t as good as they should, but those VR missions are so much fun. The portable nature of Game Boy even allows you to knock out a couple of them anytime you want, without having to suffer the slow loading speed of a PlayStation’s CD. Truly a great part of the game that I wished was even longer.</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-15.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-16.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-17.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>The VR challenges made me appreciate stealth gameplay, and I ended up wanting more. This ultimately led me to <em>Thief II: The Metal Age</em> on PC, the most accomplished game I ever played in my life. But you’re not here to talk about the VR challenges or <em>Thief II</em>, you’re playing Metal Gear for the story, right?</p>\n\n<h2 id=\"the-goddamn-story\">The Goddamn Story</h2>\n\n<figure class=\"figure figure_gb float right\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-18.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>By the end of <em>Metal Gear Solid</em>, Solid Snake has rescued the girl (or the boy?), killed his clone brother, resolved his painful relationship with the robot ninja, and solved the mystery of people mysteriously dying around him during his mission. I guess he also saved the world. It’s a convoluted ending, but it fits together nicely. Then the second game on PlayStation 2 happens, and I feel like the whole story fell off the tracks. There’s supposedly an AI colonel, incest, I think actually two cases of incest, ten Metal Gear vehicles who look like noodles, there’s a vampire in there somewhere, another AI who runs the world, and the main villain of our story is the arm of Liquid Snake attached to Revolver Ocelot thus controlling him. Oh and you don’t play as Solid Snake, you play as a new character that’s really hard to love. It’s the worst of Japanese excess. <em>Metal Gear Solid 2</em> goes up its own butt, comes out of the mouth, and goes back up its own butt a second time for good measure.</p>\n\n<p>I’m happy to report that the story of <em>Metal Gear: Ghost Babel</em> is very simple, like the early MSX 2 titles. It’s got a proper, if barebones, Metal Gear story. There’s the same difficult relationship with war and conflict, the same questions raised at our sheltered way of life. It’s just on Game Boy, so it’s very limited in scope. Their efforts are commendable, but sometimes you can’t help but laugh. After every boss battle, you’re treated to the exact same thing. The defeated boss lies on the ground explaining their whole terrible life to Solid Snake. Think about how ridiculous that is for a second. On top of that, they all have horrible circumstances imposed on them, making them into perfect victims not deserving of death. The same thing happened in <em>Metal Gear Solid</em> with the same lesson: in war, everyone is a victim. It’s commendable but by the fourth time it happens you start to giggle at the pattern’s repetition. It feels like someone writing a copy of <em>Metal Gear Solid</em>, and I mean that in the best possible sense. Hideo Kojima would make his games ever more convoluted, and I think their story lost the simple charm of the first three Metal Gear games he made. <em>Metal Gear: Ghost Babel</em>, because it was developed before the release of <em>Metal Gear Solid 2</em> can only ape those three simpler titles, and the game is better for it.</p>\n\n<p>I guess I have to talk about the canon status of the game. There are discussions that the game is the final VR training of Raiden or that the game isn’t canon. It leaves an aura of uselessness around the game, putting the game in a state of limbo, telling prospective players that it does not matter. That’s a thing I do not like. Too often these days, canon status equates to existence. If a piece of art isn’t canon, it no longer exists. Regarding these matters, I instead take an author-centric approach. The game was made with limited input from Hideo Kojima, the main driving force behind the story of the franchise. Kojima never revisited its events, so that’s where it stands. No need to attach a strict label when the game’s production history easily describes its position. Is it canon? It doesn’t really matter.</p>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-19.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>If we need to talk about one label, it’s that it was designed from the get-go as a gaiden title. Japanese gaidens (literally side story) are stories that stand to the side of the main narrative thrust. They tend to focus less on respecting the exact details of a timeline, and to instead provide further stories surrounding the characters. Those stories are not meant to propel the narrative forward, but to be a way to spend more time with the characters of an already existing narrative. In our specific case, <em>Metal Gear: Ghost Babel</em> seems to disregard the events of <em>Metal Gear 2</em>, and seems to happen instead of <em>Metal Gear Solid</em>. Maybe I don’t pay enough attention to tiny details, but to me this makes no sense. <em>Ghost Babel</em> could totally happen between the second MSX game and <em>Metal Gear Solid</em>.</p>\n\n<h2 id=\"a-working-ai\">A Working AI</h2>\n\n<p>I’ve talked time and time again that the Game Boy can’t do convincing artificial intelligence with enemy characters. Its processor is simply not fast enough to reserve large chunks of computing time to calculate complex decision trees with enemy states. Instead, enemies resort to simple clauses. <em>If the player character is close to you, run towards him</em>. That sort of thing. Then how can the Game Boy Color manage to have stealth gameplay with somewhat realistic enemy soldiers?</p>\n\n<p>The old Metal Gear titles ran on the same family of processor as the Game Boy Color but at half the speed, and they managed to have somewhat convincing soldiers with only half the processing power. They managed it by designing around the problem. A clever example is the simple enemy detection phases. When playing the game, you are either undetected in the green phase, actively hunted while under a red alarm, or restoring from an alarm in the yellow caution phase.</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-20.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-21.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bmge/cgb-bmge-22.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>With those three states, you simplify a vital element of stealth gameplay: who knows where you are? All the soldiers all know the same thing at the same time. Punching enemies in the back or killing them with your silenced pistol changes nothing. Soldiers have no sense of the absence of other soldiers. They are bothered by Snake standing in front of them or making noise close to them. That’s it. There’s an exception for soldiers silently dying in front of them, but that’s it.</p>\n\n<p>These simple states also include all the other enemy types. Cameras? Soldiers on rails. Dogs? Melee range supercharged soldiers. No enemy in the game deviates from the core principles. Even bosses either act like soldiers or like normal video game enemies that always know where you are. There’s nothing complicated about their AI.</p>\n\n<p>If we compare to something like <em>Thief II: The Metal Age</em>, which features no centralized alarm system, guards become personally aware of your presence and make noise to warn other guards within earshot. It’s incredibly complicated to implement with each soldier having independent awareness of the player. Let’s look at how the simple system of <em>Metal Gear: Ghost Babel</em> is implemented.</p>\n\n<h3 id=\"green\">Green</h3>\n\n<p>Each state allows soldiers to act differently. When you are undetected in the green infiltration phase, soldiers have a predefined path that they follow. Maybe there’s a chance they fall asleep, maybe they randomly turn around but they’re on a predetermined set of simple coded clauses. In other words, that’s the phase where the developers have hard-coded all the interesting events.</p>\n\n<p>This is also a phase where making noise can attract the enemy soldiers. You can run in water or specific flooring to make noise that attracts nearby soldiers. Knocking on walls also attracts enemies to the spot where you made the noise. They don’t see you, so they don’t trigger an alert but noise will pop a question mark above their head and send soldiers towards the noise. It’s different from visual detection, but it’s not more complicated to code. It’s just a different event.</p>\n\n<h3 id=\"red\">Red</h3>\n\n<p>You become visually detected by standing in front of soldiers. They have somewhat of a vision cone on Game Boy, but it’s pretty much a straight line up to a certain distance. When that happens, you move to the alert phase. Here, soldiers are relentless, but their coded actions are fairly minimal. Enemies remember the last position where you were spotted and head there. Enemies have no knowledge of where Snake is during an alarm, only the last position where he was spotted. Of course, if there are enemies constantly looking at you then they always know your position since you’re always under a vision cone. If they get close enough to you when they spot you, they shoot you or hit you. Killing enemies during this phase immediately respawns another enemy that enters the screen from one of its doors. That’s how you can discover that the game can only manage three soldiers per screen. Kill as many as you want, you will only ever see three enemies at the same time. Under this phase your job is to make sure none of the three enemies see you until the timer drops to zero. You then move on to evasion.</p>\n\n<h3 id=\"yellow\">Yellow</h3>\n\n<p>Under the yellow phase, enemies no longer roam around your last known position. They randomly search in the screen you’re in. Noises attract them with a question mark once again, and once the timer for this phase hits zero, you’re back in the green infiltration phase. Enemies quickly go back to the screen’s border to disappear, or return to their designated route once you finish the phase.</p>\n\n<h2 id=\"what-ai-means\">What AI Means</h2>\n\n<p>After all that detailed analysis of enemy patterns, if you have one thing to remember is that those early <em>Metal Gear</em> games aren’t much more complex than <em>Pac-Man</em>. There are more things that can change the state of the game, but nothing exceeds the complexity of a game of <em>Pac-Man</em>, down to the limited enemies on the screen at the same time. Reading about how the four ghosts act in <em>Pac-Man</em>, it’s shocking how similar it is to <em>Metal Gear</em>. Of course <em>Pac-Man</em> is much simpler, but the underlying logic is in the same realm of complexity, just expanded and used to achieve more complicated gameplay. Which explains why you can have complex enemy interactions on Game Boy: it’s not as complicated as you think, it’s the way everything is arranged in phases that makes it <em>appear</em> complicated.</p>\n\n<p>When you take a step back and look at the whole game, they also break up the game into smaller events to vary the gameplay, so you never get bored. There is water in the sewers, sections filled with security cameras, rooms of invisible lasers, two nonsensical door puzzles, darkness that requires thermal goggles, poisonous gas, and very dangerous dogs. Since they break up the gameplay so often, you don’t really have time to stop and consider the shallowness of the AI. It’s a well-made game in terms of pacing, except for the boxes level.</p>\n\n<h2 id=\"music\">Music</h2>\n\n<p><em>Metal Gear: Ghost Babel</em> has music by Norihiko Hibino and Kazuki Muraoka. A lot of the music compositions in the game, and sound effects for that matter, are adapted from previous MSX 2 titles and brought to Game Boy Color. So you get Game Boy versions of classic songs from the old games. Since those tunes were originally composed for the MSX 2, it works perfectly fine here. From chiptune on MSX 2 to chiptune on GBC, there are no issues here. It’s incredibly good music. I feel like they tried to bring the vibes of the <em>Metal Gear Solid</em> soundtrack when adapting those songs, since the music has a lot more echo than on MSX, and a much harsher sound. It’s Game Boy, so they couldn’t use more bass but they tried to imply a sound with more bass. They walked on the edge of the sword to great success here: You have the classic melodies from the older games with the muted ambiance of the PlayStation game. On PlayStation the music, while still featuring complex melodies, is more focused on ambiance than composition.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Once <strong>I</strong> was done with <em>Metal Gear:Ghost Babel</em> back in the early 2000s, I did the only sensible thing a kid without a PlayStation could do: I bought the PC version of <em>Metal Gear Solid</em>. This version of the game is still playable today, <a href=\"https://www.gog.com/game/metal_gear_solid\">courtesy of GOG.com</a>. It’s a solid port. I don’t remember having any issues with the game back then. They’ve adapted the Psycho Mantis fight, and you lose some graphical effects, but the game runs better and at a <strong>much, much</strong> higher resolution. Also, it doesn’t have the jiggling textures typical of 3D PlayStation games.</p>\n\n<p>I liked it a lot back then. I afterwards tried to play <em>Metal Gear Solid 3</em> twice. Once on PS2 and a second time on 3DS of all places. I could not care enough to play it. I recently gave a shot to <em>Metal Gear Solid V: The Phantom Pain</em>, and while I was utterly impressed by the depth of its gameplay systems, the game felt too repetitive for me. I guess the whole Metal Gear concept never really impressed me outside of the revival on PlayStation and the Game Boy Color experiment. I’ve greatly appreciated the replay I did for this article, and recommend it, even though it’s not perfect. It’s wonderful that it exists, and it’s a sort of game no one expected to see on Game Boy Color.</p>\n"},{"id":"cgb-bt4e","date_published":"2023-11-28T00:00:00-05:00","url":"https://gameboyessentials.com/articles/cgb-bt4e","title":"ESPN National Hockey Night","image":"/assets/cgb-bt4e/cgb-bt4e-start.png","banner-image":"/assets/cgb-bt4e/cgb-bt4e-start-social-share-card.png","content_html":"<h1 id=\"espn-national-hockey-night\">ESPN National Hockey Night</h1>\n\n<ul>\n  <li>North American release in March 2001</li>\n  <li>Never released in Japan</li>\n  <li>Never released in Europe</li>\n  <li>Published by Konami</li>\n  <li>Developed by Konami</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-1.jpg\" width=\"500\" height=\"500\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">Scott Gomez! Twice! No wait there’s a faint picture of him holding the cup, so that’s three! Wow! That’s terrible.</figcaption></figure>\n\n<h2 id=\"best-of-the-worst\">Best of the Worst</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>I’m Québécois, so I have been surrounded by hockey during all my formative years. For all intent and purposes, I should be a hockey aficionado. Yet I have never played hockey, I have attended a game from start to finish only once, I barely know the rules of the game, I do not know how to skate, and I do not like hockey video games. While everyone around me was thinking about hockey, I was playing Game Boy. To finally remediate this issue, I have decided to merge both fields of interest: I’ll look at the complete history of hockey games on Game Boy.</p>\n\n<p>This article is ostensibly about the last hockey release on the console: 2001’s <em>ESPN National Hockey Night</em> by the people working at Konami. But really, we’ll look at every hockey game on Game Boy in release order and we’ll all collectively learn why the last release is the only one somewhat worth playing.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Game Title</th>\n      <th>Earliest Release Date</th>\n      <th>Details</th>\n      <th>Console</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><em>World Ice Hockey</em></td>\n      <td>April 1991</td>\n      <td>Japan only, by Athena</td>\n      <td>Game Boy</td>\n    </tr>\n    <tr>\n      <td><em>Blades of Steel</em></td>\n      <td>August 1991</td>\n      <td>NA, Europe and Japan, by Konami</td>\n      <td>Game Boy</td>\n    </tr>\n    <tr>\n      <td><em>Hit the Ice</em></td>\n      <td>October 1992</td>\n      <td>NA only, by Williams</td>\n      <td>Game Boy</td>\n    </tr>\n    <tr>\n      <td><em>NHL 95</em></td>\n      <td>June 1995</td>\n      <td>NA and Europe, by Malibu</td>\n      <td>Game Boy</td>\n    </tr>\n    <tr>\n      <td><em>NHL 96</em></td>\n      <td>July 1996</td>\n      <td>NA and Europe, by Probe Entertainment</td>\n      <td>Game Boy</td>\n    </tr>\n    <tr>\n      <td><em>NHL Blades of Steel</em></td>\n      <td>May 1999</td>\n      <td>NA only, by Climax</td>\n      <td>Game Boy Color only</td>\n    </tr>\n    <tr>\n      <td><em>NHL 2000</em></td>\n      <td>December 1999</td>\n      <td>NA only, by Tiertex Design</td>\n      <td>Game Boy &amp; Game Boy Color</td>\n    </tr>\n    <tr>\n      <td><em>NHL Blades of Steel 2000</em></td>\n      <td>January 2000</td>\n      <td>NA only, by Climax</td>\n      <td>Game Boy Color only</td>\n    </tr>\n    <tr>\n      <td><em>ESPN National Hockey Night</em></td>\n      <td>March 2001</td>\n      <td>NA only, by Konami</td>\n      <td>Game Boy Color only</td>\n    </tr>\n  </tbody>\n</table>\n\n<h2 id=\"world-ice-hockey\">World Ice Hockey</h2>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-3.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-4.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>The first hockey game is <em>World Ice Hockey</em>. Released in early 1991, <strong>but only in Japan</strong>, the game was made by Athena, a small Japanese developer who overwhelmingly released games that only came out in Japan. Back in the early ’90s, a large contingent of Japanese companies only catered to their local market, with barely any of their games released outside the island nation. Even games that needed no translation like <em>World Ice Hockey</em> and could have been successful in North America, the home land of ice hockey. It’s fascinating. Did they lack the money to release their games in North America? I’m pretty sure that’s why they stayed in Japan. They never got big enough.</p>\n\n<p><em>World Ice Hockey</em> is incredibly barebones and simple. It’s making me think of my beloved <em>Ice Hockey</em> on NES but not in a good way. It’s got small chubby sprites similar to <em>Ice Hockey</em>, but the ice rink is ginormous. You’re supposed to be playing international hockey, which has a bigger rink but this is way too big. The characters are way too small, skate super slowly, and the AI is not very competent. Perhaps the AI is OK; I was playing Canada against Japan and that might have had something to do with it. You see, except for the fact that Japanese developers made these games, Japan has no reason to be in an ice hockey video game. The Japanese national ice hockey team can’t even play competitively against mid-tier teams from the Québec semi-pro league, so a game against the best hockey players in Canada is no contest. To reflect that sad reality, the Japanese team’s stats in <em>World Ice Hockey</em> are laughably low.</p>\n\n<p>Anyway, on to the next game.</p>\n\n<h2 id=\"blades-of-steel\">Blades of Steel</h2>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-5.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-6.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>The second game is the Game Boy version of the famous <em>Blades of Steel</em>. Released in late 1991, this Game Boy version came out as <em>Konamic Ice Hockey</em> in Japan. Yes, with a C. <em>Blades of Steel</em> is a side-to-side game, and it has a strong action-oriented feel. Originally released in arcades, the NES version of <em>Blades of Steel</em> has a reputation as a solid hockey game. I’ve always heard it placed at the same level as perennial classic <em>Tecmo Bowl</em>. Is the Game Boy version just as good? I played both the NES and Game Boy versions one after the other to figure out the differences and I can’t really see any missing features. The shots you take at the net are done with a moving arrow, that goes up and down until you take your shot. This is the core idea of the game, and is present in both versions. What is different between them is the fluidity. The Game Boy version is slower, choppier. Unfortunately, this lessens the experience. Maybe the developers simply didn’t have enough time and money to replicate the snappy response you see in arcades and NES. Or, as is often the case on Game Boy, the speed of the link cable severely limited their ambitions. Since <em>Blades of Steel</em> is a multiplayer title, the game has to be playable with two Game Boy consoles connected with a Link Cable. This means the developers had to make sure they could transmit the exact position of 10 characters plus a puck 60 times a second from one console to another. This is a tall order for a transfer rate of <a href=\"https://gbdev.gg8.se/wiki/articles/Serial_Data_Transfer_(Link_Cable)\">one kilobyte a second</a>. If you do the math, one kilobyte a second allows you to send 16 bytes every sixtieth of a second. That’s not even two bytes per hockey player. I’m pretty sure the game cannot update 60 times a second with that low transfer rate. They probably set the game’s speed to be as fast as the link cable would allow. This gives you a choppy experience on Game Boy, when most players never had two copies of the game to play with a friend.</p>\n\n<h2 id=\"hit-the-ice\">Hit the Ice</h2>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-7.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-8.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>Up next is <em>Hit the Ice</em>. I first played the arcade game on MAME and didn’t see a particularly good game. It is nonetheless interesting. It’s a two-on-two hockey game more focused on antics than legitimate hockey plays. Basically, it’s doing the same thing as <em>NBA Jam</em>. The crazy thing is that <em>Hit the Ice</em> released in arcades three years before the basketball classic. It’s even more irreverent than <em>NBA Jam</em>, with fictional players that look like they’re rejects from <em>Toxic Crusaders</em> and a big focus on punching your opponents. It made me think of <em>Clayfighter</em> a little bit. Not in artistic style, but in attitude. Both games are not taking themselves seriously at all, both are very unfocused. I do not personally like the art style nor the gameplay they went with but I can see the amount of time it took to achieve the desired effect and respect it.</p>\n\n<p>As for the Game Boy version? It’s dreadful. <em>Hit the Ice</em> for arcades is a graphical showcase. Its core appeal is its cartoony sprite work. On Game Boy, you’re playing a terrible port of a game that has no business being on Game Boy. You can’t make a graphical showcase on that console, the screen’s resolution is too small to make it feasible. So you end up with an inferior copy in every way. It’s like <a href=\"https://en.wikipedia.org/wiki/Allegory_of_the_cave\">Plato’s allegory of the cave</a>. You’re stuck seeing a shadow projection of a game that exists as a lifelike experience only outside of Game Boy.</p>\n\n<h2 id=\"nhl-hockey-95-and-nhl96\">NHL Hockey &#8216;95 and NHL 96</h2>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-9.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-10.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-11.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-12.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>Then we have NHL 95 and NHL 96. The fact that they’re on Game Boy is somewhat of a surprise. I guess that’s when the NHL series by EA Sports hit its highest peaks of popularity. It seems even people with no interest in the sport of hockey enjoyed the series in the mid ’90s. It also coincided with the most famous hockey player of all time, Wayne Gretzky, playing for the most valuable hockey club in the world, the New York Rangers. So you have this great confluence of events that helps to propel Electronic Arts’ hockey games. They’re on every important platform, so why not try Game Boy and Game Gear versions? They subcontracted small developers to make the games. Then they clearly abandoned the idea after the first year on Game Gear and after two years of miserable releases on Game Boy. They even switched the development company after the first year. If I had to bet, I’d say they didn’t make any money with those portable games.</p>\n\n<p>Let’s talk about one thing that massively irks me about both the ’95 and ’96 titles: start times. A Game Boy is a peculiar thing; it’s a portable console you often play for very short play sessions. Perhaps you have only five minutes in between two tasks to pull out your Game Boy and play a bit. For that reason it is vital that a game starts quickly. However, a ton of <em>Game Boy</em> titles didn’t respect your time and take forever to get to the point. <em>NHL Hockey &#8216;95</em> is the worst example of this problem. Look at all the screens the game forces you to go through before you can start the process of playing some goddamn hockey:</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-13.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-14.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-15.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-16.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-17.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-18.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-19.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-20.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-21.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-22.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>They even force you to go through the credits every time you start the game! Every single one of those screens has a mandatory amount of time they need to appear on screen but they don’t move on without pushing the Start button. This is the worst. I clocked the minimum amount of time you have to waste trying to get through them as fast as possible. You have to mash the Start button for 30 seconds. In the world of Game Boy, that’s an eternity. Then you get to the game proper and it’s somehow even worse. The game is running so slowly I assumed my emulation was busted. It’s even worse than <em>Blades of Steel</em>, and it doesn’t even have multiplayer to explain its slow tick rate. I assumed the second title, <em>NHL 96</em>, would solve all the issues of the first game. No! It’s got the same exact slow tick rate issues. The interface is also terrible: I could not figure out how to have a goalie in your net. I’m not an idiot, and the goalie selection screen was completely inscrutable for me. With <em>NHL 96</em>, the goalie screen is the same but you start with a goalie, so I couldn’t find out how to swap them out. Supremely dumb stuff.</p>\n\n<p>Since neither of the Electronic Arts games have multiplayer, they really only have one interesting feature: playing a full season with playoffs. However, the games don’t have a save battery. So you have to enter a loooooong password every time you want to pick up where you left off. 30 seconds to start the game, easily two minutes to punch in the 18-character password. Then you start the game and it’s a low frame rate mess with bad gameplay. Those two games are despicable. Why oh why did I decide to play all those horrible hockey games. I wished I had always been dead.</p>\n\n<h2 id=\"nhl-blades-of-steel\">NHL Blades of Steel</h2>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-23.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-24.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>With my morale at its lowest point, we get to another <em>Blades of Steel</em> game. I really do mean another. It’s the same game as the Game Boy one from years ago, with a fresh coat of paint to hide the fact this game is eight years old. Its developed by the people at Climax Studios, who had only ever done ports of preexisting games. They added colour with this reissue, of course, but outside of that nothing is visually different. It has the same goal screen and everything. However, they have improved the players’ movement speed. It feels smoother. Perhaps the faster Game Link speeds of the GBC allowed them to increase the speed of the game?</p>\n\n<p>The only interesting thing about this game was that it was released in 1999. By that point, <em>Pokémon</em> had revitalized the Game Boy, with the Gold &amp; Silver games coming out next year. Pokémania was at a fever pitch, and thus the Game Boy Color was a viable console for a resurgence of Konami hockey titles. Game Boy literally had its best sales year in 1999. It explains the large gap between <em>NHL 96</em> and this game. During the gap of 1996 to 1998, no one cared about Game Boy. Most people assumed the console’s life was over, since its sales were abysmal. So no one made hockey games during those gap years.</p>\n\n<h2 id=\"nhl2000\">NHL 2000</h2>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-25.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-26.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>As I just said, from 1998 to 2000, the Game Boy was hot. So not only did Konami rerelease their <em>Blades of Steel</em> game with an updated roster, faster gameplay and coloured graphics, EA also tried its luck again on Game Boy.</p>\n\n<p>You’d think that just like Konami, EA would rerelease their 1996 game with an updated roster and colour. That’s surprisingly not what they did. It’s a brand new game with completely different gameplay. The game is top-down and made by a better team; the developers at Tiertex, which we have already covered once. They would make <em>Toy Story Racer</em> just two years later.</p>\n\n<p>The game’s still bad. No surprise here. I played it a bit and it was just hard to move around. It felt like the worst mixture of floaty and unresponsive. I didn’t like it.</p>\n\n<h2 id=\"nhl-blades-of-steel2000\">NHL Blades of Steel 2000</h2>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-27.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-28.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>Did Konami release the same game three times? Yes, they did! I don’t even care enough at this point to even check if there’s anything new. As far as I’m concerned, I’m clocked out of the <em>Blades of Steel</em> games. Let’s move on to the last game, once again by Konami. This time, however, they developed a brand new game instead of asking a small team to rerelease their old game.</p>\n\n<h2 id=\"espn-national-hockey-night-1\">ESPN National Hockey Night</h2>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-29.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-30.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-31.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bt4e/cgb-bt4e-32.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>We now come to the main course of this exploration. The only game in this whole sad list that’s actually worth playing. All the other titles we looked at have glaring flaws. This one has terrible flaws too, but because it was made by a team of good developers who understood the Game Boy Color, it’s somewhat tolerable.</p>\n\n<p>It’s not the best-looking game of the bunch, with the sprites of the hockey players being weird pixelated blobs. Its graphics might be messier but its gameplay is far less disorganized than <em>Blades of Steel</em>. Playing it, you understand you somewhat need to construct plays. Passing the puck does not feel like an exercise in futility. In <em>Blades of Steel</em>, passing feels like a useless thing. Why pass when you can just skate around everyone trying to stop you? That’s ultimately the reason why this game is the best one on the console. It&#8217;s the only one that resembles a game of hockey. So let’s move on to extremely weird name of the game.</p>\n\n<p>Why does this game have the ESPN name? Konami clearly tried to compete on the hockey game front in the late ’90s, initially using the <em>Blades of Steel</em> name. They released games on TV consoles for a couple of years, with the previous two GBC <em>Blades of Steel</em> games. They then tried moving to the ESPN name, for what would end up their last year of Konami hockey titles. The next year, another ESPN hockey game came out, but this time made by Sega. Konami had clearly given up. Sega used the ESPN name and turned the ESPN licence into their sports title name until 2004.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>The history of hockey games on Game Boy is the North American history of the little portable console itself. You have some rinky-dink early games when the console was still burgeoning in 1991 and 1992. It was successful, but developers did not know exactly what to do with the console. So they ported, with many issues, their arcade titles.</p>\n\n<p>Then games get more complicated, as the same time as they become mere versions of more successful console releases, with <em>NHL 95</em> and <em>NHL 96</em>. Those releases dry up, without any 1997 or 1998 release, as the console is slowly losing any sort of momentum. People barely buy any new Game Boy games. Then, a large number of games come out between 1999 and 2001, due to the massive renewed success of the platform coming from the Pokémon craze. Everybody is crazy for Game Boy Color.</p>\n\n<p>And amongst all these games, the same exact multiplayer problem: if you want to play a Game Boy hockey game with a friend, you need two copies of the same game. This means that outside of <em>Tetris</em>, which came bundled for a long time with the console and was thus ubiquitous, it was very difficult to arrange a multiplayer session with another player. So barely anyone could play against a friend; the most fun you can have with a hockey game. No wonder they were never popular.</p>\n\n<p>I want to say thank you to my wife for tolerating me, once again. When I started saying my next article was about hockey, she said <em>it was cute when it was Mario or Yoshi, but I don’t even want to hear you talk about hockey</em>. Then she told her friends I was writing about these games, and everybody started making fun of me. This article was brought to you after much social hardship. I suffer for my writing playing those dumb hockey games, and then people make fun of me for playing them. I think I deserve it.</p>\n"},{"id":"dmg-ci","date_published":"2023-04-29T00:00:00-05:00","url":"https://gameboyessentials.com/articles/dmg-ci","title":"Yoshi’s Cookie","image":"/assets/dmg-ci/dmg-ci-start.png","banner-image":"/assets/dmg-ci/dmg-ci-start-social-share-card.png","content_html":"<h1 id=\"yoshis-cookie\">Yoshi’s Cookie</h1>\n\n<ul>\n  <li>Japanese release in November 1992</li>\n  <li>North American release in April 1993</li>\n  <li>European release in 1993</li>\n  <li>Published by Nintendo</li>\n  <li>Developed by TOSE &amp; Bullet-Proof Software</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-1.jpg\" width=\"720\" height=\"726\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">Ah, a bilingual box. Are there any collectors out there specifically of Canadian releases?</figcaption></figure>\n\n<h2 id=\"play-around-with-your-cookies\">Play Around With Your Cookies</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p><em>Yoshi’s Cookie</em> is an unimpressive game with a beautiful premise. You start the game, you play one of its two simple modes and you realize it’s just a fine game about baking cookies. These days, a puzzle game with so few features would be derided. But it was good enough to warrant a small portion of your essential attention back in 1992 because of its creative design.</p>\n\n<h2 id=\"how-do-you-play-yoshis-cookie\">How Do You Play <em>Yoshi’s Cookie</em>?</h2>\n\n<p>Let’s discuss how <em>Yoshi’s Cookie</em> functions. You are presented with a board filled with cookies. You have a cursor that allows you to select a specific cookie. Pressing the X button then allows you to move rows and columns along the axis of that cookie. Cookies going past the other cookies will move to the other side of the board, keeping your playfield shaped like a rectangle at all times. While you move your field, new cookies start appearing from the top and right side of the board, slowly moving to align themselves with your batch of cookies. Using your single ability, you have to do the classic puzzle game task: match the objects. You make rows or columns of your playfields’ length, which then makes the matched cookies disappear.</p>\n\n<p>I have nothing against the game, but it falls into the category of puzzle games I lovingly call <em>I can’t get good at this shit</em>. I am incapable of making high-level plays that allow you to get better at the game. You can arrange cookies in rows and columns to make them disappear. You’ll succeed for a bit but the real high-level play, the real talent you need to develop to succeed is to arrange the board so multiple rows and columns get completed at the exact same moment. To achieve this, you have to arrange the board with the maximum number of pieces that can be next to one another without creating a match. You need to do that for multiple rows and/or columns and you need to figure out a way to start those matches with a single move. It’s very similar in logic to learning how to solve a Rubik’s cube. You have to plan multiple moves ahead of time.</p>\n\n<figure class=\"figure figure_gb float right\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-3.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>Multiple puzzle games have this prepared combo as their core premise. For example, <em>Puyo Puyo</em>, <em>Columns</em>, and to a lesser extent <em>Dr. Mario</em> all expect you to prepare combos. My problem is I’m horrible at preparing combos. I can get kind of bad at it but it’s hard for me, so a game really has to ease me into the combo-making steps. If you can show me how to make combos, with predefined puzzles that force you into the steps necessary to achieve it, I might be able to learn it before I get bored and give up with the game.</p>\n\n<p>Another way for me to learn is by having an AI opponent make combos. That way I can see high-level play used against me and learn from it. This game being on Game Boy with its tiny screen, the VS mode does not show you your adversary’s moves. You can’t see their tactics and learn from them. With all those little issues piling up, <em>Yoshi’s Cookie</em> was unable to hold my attention long enough to force me to learn how to make its combos.</p>\n\n<p>So while I’m not particularly enamoured by <em>Yoshi’s Cookie</em> as a game, I do love its development history.</p>\n\n<h2 id=\"from-home-data-to-bullet-proof-software-to-nintendo-to-tose-to-your-game-boy\">From Home Data to Bullet-Proof Software to Nintendo to TOSE to Your Game Boy</h2>\n\n<p>How was <em>Yoshi’s Cookie</em> created? On the heels of <em>Tetris</em> being the flagship title for Game Boy, many developers were now making and selling puzzle games on Game Boy. Players were invariably looking for something like <em>Tetris</em> but different enough to give them a new experience. It was assuredly a profitable venture for those companies, but <a href=\"https://www.chrismcovell.com/GameBoyDecline.html\">the games never accounted for more than 30% of yearly releases on the console</a>. This low number of puzzle titles is in part due to how difficult it is to develop one. It takes a lot of time and creative thinking to invent a puzzle concept. This constant stream of puzzle releases was nonetheless a differentiating advantage of Game Boy in the early ’90s; the <a href=\"https://www.mobygames.com/game/genre:puzzle/platform:game-gear/sort:date/page:1/\">Sega Game Gear</a> and <a href=\"https://www.mobygames.com/game/genre:puzzle/platform:lynx/sort:date/page:1/\">Atari Lynx</a> only offered their players a pitiful selection of puzzle titles and they never had <em>Tetris</em>. Henk Rogers snagged a portable console exclusivity agreement from Elorg for Nintendo. Henk Rogers once again pops up, and he is not only responsible for <em>Tetris</em> on Game Boy, but also responsible for <em>Yoshi’s Cookie</em>.</p>\n\n<p>Ever the dealmaker, Henk Rogers finds a puzzle game called <em>Hermetica</em> developed by Home Data, a small Japanese company. The creator of the original game has <a href=\"https://twitter.com/gdri/timelines/609352873663705089\">talked about the development history on Twitter</a>, and a translation by GDRI is available on the <a href=\"https://gdri.smspower.org/wiki/index.php/Talk:Biox\">talk page for Biox of all places</a>. They created the concept of the game as a way to do something with the old unused arcade boards the company had. The game had zero connection with Nintendo or Yoshi at that point. It was merely the work of a small Japanese company. The game used an alchemy conceit and a slightly different rule set. They finished development and moved on to a test release in two arcade locations in Japan. This test was very unsatisfactory. The people at the company then started shopping the game around to other companies in the hope they would license it. Henk Rogers was sent a prototype arcade board and saw enough potential to license the concept.</p>\n\n<figure class=\"figure figure_pixel\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-4.png\" width=\"292\" height=\"240\" alt=\"Screenshot\" /></figure>\n\n<p>He afterwards commissions the employees at his company to work on their own version seemingly called <em>Inaro</em>. We’re not sure on how and when but Henk Rogers managed to convince Nintendo to join the project. They provided their greatest asset; the game was rebranded with their hottest new character, Yoshi. TOSE was at some point commissioned with the production of the NES and Game Boy version of what was now called <em>Yoshi’s Cookie</em> and Bullet-Proof Software made and finally released the SNES version eight months after the NES and Game Boy versions. <a href=\"https://www.mariowiki.com/Yoshi’s_Cookie#Development\">Super Mario Wiki covers the development history very well</a> and has links to fascinating details regarding <em>Inaro</em>.</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-5.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_pixel gallery\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-6.png\" width=\"292\" height=\"240\" alt=\"Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_pixel gallery\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-7.png\" width=\"292\" height=\"239\" alt=\"Screenshot\" /></figure></div>\n</div>\n\n<p>The mystery of <em>Yoshi’s Cookie</em> strange release still lingers in my mind. You have two versions made by TOSE, the GB and NES versions. Those versions are for all intent and purposes the same and you have a very different SNES version that came out eight months later made by BPS. What’s even weirder is that the NES and Game Boy versions reference <em>Hermetica</em> in their debug menu.</p>\n\n<p>If I had to hazard a guess, I’d say BPS was working on their own version for Super Famicom, under the codename <em>Hermetica</em>. When Nintendo came along and joined the project, they let BPS continue with the Super Nintendo/Super Famicom version and they took care of the Game Boy and NES/Famicom games. Nintendo then used TOSE as a subcontractor. They often used the company back then for lesser projects. A brand new puzzle game they didn’t fully own was a perfect use of TOSE, the shadow company who refuses to be credited for their work. TOSE quickly pumped out their two versions while BPS took more time, being a much smaller company. They also took the opportunity to implement more features. During this development, the codename of <em>Hermetica</em> was probably kept even after <em>Yoshi’s Cookie</em> became the game’s conceit later during development. Yoshi was an obvious choice for the game; it was a hot new character and Nintendo had already released a puzzle game bearing the name the year before. This could be seen as a kind of sequel. In terms of what’s different between the TOSE games and the BPS version for SNES, we have to talk about the last good Russian, Alexei Pajitnov.</p>\n\n<h2 id=\"alexei-pajitnovs-role\">Alexei Pajitnov’s Role</h2>\n\n<figure class=\"figure figure_pixel float left\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-8.png\" width=\"292\" height=\"239\" alt=\"Screenshot\" /></figure>\n<p>Pajitnov is credited on the box of the SNES version as a puzzle designer. I think he was a subcontractor, and honestly I’m a bit shocked he wasn’t on the marketing for the game. Keep in mind, dear reader, that he made puzzles for the SNES and SNES version only. He is <a href=\"https://www.mobygames.com/game/snes/yoshis-cookie/credits\">not credited on Game Boy, and his creative puzzles are nowhere to be seen</a>. I’m inclined to think Pajitnov worked on the game before the Yoshi branding was even decided. I get that putting his name on the box might have been confusing. You have decided on focusing the game on Yoshi and Mario, so Pajitnov only confuses things. But they totally could have had the puzzle section called <em>Pajitnov’s Challenges</em> or something. You mention it on the back of the box. In the game you put a little chibi version of Pajitnov just like Will Wright in <em>Sim City</em>. You have him say something along the lines of: &#8220;I invented <em>Tetris</em> you know! Can you solve my cookie puzzles? They’re devious, and delicious!&#8221;</p>\n\n<p>That would have been cool. Especially since the Pajitnov puzzles of the SNES version are easily the best thing about any version of <em>Yoshi&#8217;s Cookie</em>. I heartily recommend giving them a try. It really shows that a great puzzle maker made them. In the end, I’m not Henk Rogers and I don’t know what was reasonable to do with Pajitnov’s likeness. Rogers and Pajitnov were, and are, friends and started The Tetris Company just a couple of years later. Maybe Pajitnov wasn’t interested in that kind of fame?</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<figure class=\"figure figure_gb float right\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-9.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>I’ve previously mentioned my hatred for the 1991 game <em>Yoshi</em>. Not <em>Yoshi’s Cookie</em>, just <em>Yoshi</em>. Another puzzle title featuring everybody’s favourite ridable dinosaur, <em>Yoshi</em> was a paper-thin excuse for a puzzle game that revealed its shallowness after mere minutes of play. Once you had hatched your first Yoshi with wings after a couple of minutes, you had seen everything the game had to offer. It was a sad game. Game Freak, the crew of people ultimately responsible for <em>Pokémon</em> made <em>Yoshi</em>. I think this proves my point that puzzle games are hard to make. Though the people at Game Freak were young and inexperienced, they had raw talent and great ideas. They were unable to make a good puzzle game and resorted to a very derivative concept.</p>\n\n<p>Fortunately, <em>Yoshi’s Cookie</em> is neither shallow nor poorly made. It came a year later and was a sort of sequel to the earlier game, but it was developed by a completely different group of people. In contrast, Henk Rogers and the fine people at BPS knew how hard it was to come up with a good idea for a puzzle game. That’s why they licensed the original arcade concept. That’s why Nintendo collaborated with BPS; they knew good puzzle concepts are few and far between.</p>\n\n<p>Ultimately, TOSE only needed to implement the puzzle concept for Game Boy and Famicom. The hardest part, coming up with the idea, was already licensed and adapted by the most successful company in the puzzle games market. It’s just a shame I’m so bad at preparing combos and can’t fully enjoy the game.</p>\n\n<figure class=\"figure figure_pixel\"><img class=\"figure_img\" src=\"/assets/dmg-ci/dmg-ci-10.png\" width=\"292\" height=\"240\" alt=\"Screenshot\" /><figcaption class=\"figure_figcaption\">Boo-urns!</figcaption></figure>\n"},{"id":"dmg-ht","date_published":"2023-03-05T00:00:00-05:00","url":"https://gameboyessentials.com/articles/dmg-ht","title":"Tetris Blast","image":"/assets/dmg-ht/dmg-ht-start.png","banner-image":"/assets/dmg-ht/dmg-ht-start-social-share-card.png","content_html":"<h1 id=\"tetris-blast\">Tetris Blast</h1>\n\n<ul>\n  <li>Japanese release in March 1995 as <em>Super BomBliss</em></li>\n  <li>North American release in January 1996</li>\n  <li>Released in Europe in June 1996</li>\n  <li>Published by Bullet-Proof Software in Japan</li>\n  <li>Published by Nintendo everywhere else</li>\n  <li>Developed by Bullet Proof Software</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-1.jpg\" width=\"624\" height=\"631\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">Tetris in name only?</figcaption></figure>\n\n<h2 id=\"a-blast-without-a-bang\">A Blast Without a Bang</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>To get to 1995’s <em>Tetris Blast</em>, we need to go back half a decade. It is the summer of 1989, and the Soviet Union is clearly falling apart. Stretched to its limits by incessant military spending and its stagnant managed economy, what was supposed to be a reasonable political realignment finally broke the Communist Party’s ability to maintain power. Called Perestroika (Restructuring) and Glasnost (Openness), once these policies begin implementation, independence movements across the Warsaw Pact will start organizing. By the summer of 1989, a veritable wellspring of revolutions will start in just a couple of months across Eastern Europe, and the Polish people have already been allowed to vote in a free election, leading independent union Solidarność to enter the political sphere and to start breaking Communist rule in Poland.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-3.jpg\" width=\"640\" height=\"963\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><em>Tetris</em> for Macintosh, released in 1988.</figcaption></figure>\n\n<p>During this troubling era, Game Boy is released in North America and no one bats an eye that it comes with a Russian-themed game; it’s in vogue. The once evil Soviet populace is now seen as a group of oppressed nations yearning for freedom. Nintendo’s <em>Tetris</em> for Game Boy fits into this new narrative, with its imagery of the Orthodox Church, Russian folklore and Russian rocketry including the <a href=\"https://en.wikipedia.org/wiki/Buran_(spacecraft)\">Buran spaceplane</a> while not focusing on the CCCP regime. Less than six months after the release of the Game Boy the Berlin Wall has fallen and the Communists are undeniably on the way out. So there’s no reason to complain about a game with Russian iconography. They’re no longer the villains, they’ll soon be our friends. Ouf.</p>\n\n<figure class=\"figure figure_art float right\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-4.jpg\" width=\"315\" height=\"401\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">Alexei Pajitnov. Credit <a href=\"https://commons.wikimedia.org/wiki/File:Alexey_Pajitnov_-_2575833305_%28crop%29.jpg\">Eunice Szpillman</a>.</figcaption></figure>\n<p>The jovial Russian mathematician who created the tetrominoes game, Alexei Pajitnov, is making a new puzzle game about hats while this is happening. This is how he makes money in the video game industry, since he receives nothing from the licensing deals of <em>Tetris</em>. His former employer, the Soviet state, is cashing in all the dough and they are not redistributing the wealth his way. However, Pajitnov is already very well known for having created <em>Tetris</em>, which has quickly become a famous video game. So his new puzzle games are promoted with his name. It has a certain appeal; a puzzle game from the creator of <em>Tetris</em> must be fun! <em>Welltris</em> is being developed at the company that will become Spectrum Holobyte. He also starts working on <em>Hatris</em> and <em>Faces… Tris III</em> at his Dutch buddy Henk Roger’s company, Bullet-Proof Software. Just a year after the release of <em>Hatris</em>, Pajitnov leaves Russia to work for Sprectrum Holobyte in the United States. His credited work takes a nosedive, and he ends up joining Microsoft in 1996 to work on puzzle games there.</p>\n\n<figure class=\"figure figure_art float right\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-5.jpg\" width=\"640\" height=\"830\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><em>Super Tetris</em></figcaption></figure>\n<p>During this time, licensees are making their own improvements on the <em>Tetris</em> formula but they don’t include classic modes in their games. While players have always enjoyed improvements on the classic formula and variants that spice things up, there is a fundamental quality with the original version of the game. <em>Tetris</em> has this magical feeling when played in its classic form. It’s visceral. It’s vital. It vibrates. Introducing bombs or weirdly shaped blocks changes its nature. It makes it into something else and if you just want regular <em>Tetris</em> a game like <em>Super Tetris</em> on PC and Macintosh is unsatisfying. It&#8217;s a problem because it can confuse consumers. Imagine you&#8217;re in a store, and the only <em>Tetris</em> version on shelves is <em>Welltris</em>. You&#8217;re stuck buying a heavily modified version of the original game. It might sour you on <em>Tetris</em> altogether.</p>\n\n<p>This is a problem The Tetris Company has addressed since 1996. Since its creation, they have forced licensees to make sure a classic mode is always included. If you want to understand the magical qualities of a good bog-standard game of Tetris look no further than <a href=\"https://tetris.com/play-tetris/\">The Tetris Company’s own free online version of the game</a>. It’s the reference version they show licensees to highlight their strict rules on gameplay and presentation, and <a href=\"https://gizmodo.com/tetris-creators-on-the-one-version-of-tetris-they-would-1850303177\">Alexei Pajitnov has called it his favourite version of <em>Tetris</em></a>, hammering the point home that that this is <em>the correct one</em>.</p>\n\n<figure class=\"figure figure_art float left\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-6.jpg\" width=\"640\" height=\"355\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><em>Super Tetris 2 + Bombliss</em></figcaption></figure>\n<p>Back in the early ’90s, Elorg, the original owner of <em>Tetris</em>’ copyright, is not concerned by any of this. They’re probably more focused on the survival of their state institution in this era of Soviet implosion. One licensee gets it though; Bullet-Proof Software. Remember, this is Henk Rogers’ company. He is a Dutch game developer living in Japan with the exclusive <em>Tetris</em> console licence in Japan. He publishes a series of games in Japan called <em>Tetris 2 + BomBliss</em> (for Famicom), <em>Super Tetris 2 + BomBliss</em> (for Super Famicom, PC-98, Windows, and Macintosh), and <em>Super Tetris 3</em> (for Super Famicom). Those games all include variations on the classic <em>Tetris</em> formula but most importantly they also include classic <em>Tetris</em> modes as well. They’re also a hodge-podge in terms of development credits. The first Famicom game gives SEDIC the credit for the concept of <em>BomBliss</em> (later games credit APE, which must have bought them), Chun Soft is credited with the programming, and Japanese war crimes denier Sugiyama Koichi is credited for the music. Clearly, Henk Rogers knew how to make deals, his games have too many!</p>\n\n<p>You might wonder why Henk Rogers has the exclusive console licence to <em>Tetris</em> in Japan, and Japan only? His genius dealmaking is responsible and if you have the time I would recommend watching the hour-long documentary <em>Tetris: From Russia With Love</em> from the BBC (it’s free on YouTube, don’t tell anyone!). You will learn the convoluted story that led us there. Let me try to give the short version:</p>\n\n<ul>\n  <li>Robert Stein, a British software publisher, got a loose Tetris licence in 1988 that he sub-licensed to hell and back.</li>\n  <li>Henk Rogers got the console rights for Japan from him, and when Hiroshi Yamauchi, Nintendo’s genius CEO, asked Rogers to get them the worldwide portable console rights, Henk Rogers got fed up with Stein’s stalling and flew to Moscow.</li>\n  <li>He finagled his way to a meeting with Nikoli Belikov, the Elorg employee assigned to the <em>Tetris</em> licence. He showed him that Stein had sub-licensed <em>Tetris</em> for consoles, while Belikov believed Stein’s licence only covered computers.</li>\n  <li>Belikov then had Stein sign a tighter deal clearly limiting his licence to computers with screens and keyboards. Because Stein was also in Moscow, by happenstance, at the same time.</li>\n  <li>Belikov afterwards hitched his wagon to Henk Rogers. Belikov maintained Rogers’ exclusive Japanese console rights, and gave Bullet-Proof Software portable rights, which was then sub-licensed to Nintendo.</li>\n  <li>Rogers also got Nintendo of America the console rights in North America for good measure.</li>\n</ul>\n\n<figure class=\"figure figure_art float left\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-7.jpg\" width=\"660\" height=\"456\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">Alexei Pajitnov, Henk Rogers, and Hiroshi Yamauchi. Credit Henk Rogers.</figcaption></figure>\n<p>Henk Rogers made friends with everybody important. He was a personal friend of Hiroshi Yamauchi, probably the only westerner to ever befriend the genius Nintendo CEO renown for his stern personality. Henk Rogers made friends with Tetris creator Alexei Pajitnov and later went into business with him. Without a doubt though, his greatest accomplishment in friendship-making is with Nikoli Belikov. He was the taciturn Soviet technocrat Elorg tasked with reviewing the licensing agreement they had with Robert Stein. They were never chummy, but they were seeing eye-to-eye and trusted one another.</p>\n\n<figure class=\"figure figure_art float right\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-8.jpg\" width=\"761\" height=\"1006\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><em>Faces… Tris III</em></figcaption></figure>\n<p>The traditional story of how Henk Rogers outmanoeuvred Robert Stein always disregards the most powerful tool in Henk Rogers arsenal; cold hard cash. A Tetris computer licensee can expect to sell from 10,000 to 100,000 units of their computer Tetris version for 40 to 50 bucks. Generously, that’s in the ballpark of 5 million dollars in <strong>revenue</strong>, not profit. You need to pay for development of the game. Then you need to pay for production of the disquettes (or tapes) and the box with all the printed material. You’re not done! You need to distribute the game. It’s expensive to truck carboard boxes across the world. You finally need to pay for advertising and marketing to let people know you have a game. Licensees could expect to give the Soviet state maybe half a million dollars for a gangbuster success if their deal was for 10% of profits, and I’m extremely aggressive on the terms. It makes no sense that Robert Stein signed a deal worth 10% of profits. I would presume he had something more generous than what Nintendo ultimately signed.</p>\n\n<p>In the console world, Henk Rogers’ negotiating hand was full of unbeatable cards dealt by Yamauchi. He, and his card company turned toymaker, had already bet on selling millions of Game Boy consoles. The Famicom was a global success, Nintendo was very confident in its ability to market and sell Game Boy so they were willing to commit a lot of money upfront. The plan was already conceived to ship <em>Tetris</em> with every single Game Boy outside Japan. That’s probably why they sent Rogers instead of going the usual corporate route; they very quickly needed the rights and were willing to pay Rogers handsomely if he could make the deal happen quickly. For the North American console rights (according to the BBC documentary <em>From Russia with Love</em>) Nintendo of America paid $500,000 upfront and committed to 50 cents per cartridge sold. For the 8 million copies of <em>Tetris</em> on NES sold, that’s 4 million US dollars they sent to Elorg. I can’t find the exact terms for <em>Tetris</em> on Game Boy, but it’s very possible Nintendo paid a million or two upfront and the same 50 cents a copy. With a reported 29.72 million manufactured copies of <em>Tetris</em> on Game Boy including bundles and separate sales, that’s potentially 15 million US dollars for Elorg for the Game Boy version of the game. Maybe the deal was for less than 50 cents per copy, but I don’t know why Elorg would have agreed to lower terms for Game Boy. If anything the fee might have been higher. I don’t see how Robert Stein, with all his useless British bravado and futile attempts to get Gorbachev to intervene, could rival the millions of dollars Yamauchi was able to guarantee.</p>\n\n<p>And through all of that, when starting every Game Boy copy of <em>Tetris</em>, the first words you see are: <em>Tetris licensed to Bullet-Proof Software and sub-licensed to Nintendo</em>. Henk Rogers was making some money with every copy of <em>Tetris</em>. Not bad for one trip to Moscow on Yamauchi’s request.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-9.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">Henk Rogers’ work as a matchmaker, credited on every copy of <em>Tetris</em> for Game Boy.</figcaption></figure>\n\n<h2 id=\"henk-rogers--nintendo\">Henk Rogers &amp; Nintendo</h2>\n\n<p>Henk, like I said, uses his Japanese licence in the ’90s, after his return from Moscow, to make a series of improved games. They’re called <em>Tetris 2 + Bombliss</em>, <em>Super Tetris 2 + Bombliss</em> and finally <em>Super Bombliss 3</em>. But there’s one company who fundamentally does not get the need to offer a classic Tetris mode.</p>\n\n<p>Nintendo.</p>\n\n<p>That’s right. They immediately understood that <em>Tetris</em> would make Game Boy a global smash hit. But they didn’t understand that all copies of anything called <em>Tetris</em> should offer a classic mode. With <em>Tetris 2</em> and <em>Tetris Attack</em>, Nintendo treated the word Tetris like it simply means falling-block puzzle. They commissioned completely new falling-block puzzle concepts and called them <em>Tetris something</em>. It’s also indicative of Nintendo’s development strategy. Every Game Boy already has a very good copy of <em>Tetris</em>. Outside of Japan, everybody who bought a Game Boy already owns <em>Tetris</em>. Why spend so much time and effort to redo the same thing twice? That’s Nintendo’s approach for you. They’re a smaller software company than you think. Managing their small amount of resources is vital. If <em>Tetris</em> is already available on Game Boy, they don’t want to reimplement what they’ve already done. They need to provide new experiences to stay relevant with their small headcount. A great example is the Nintendo developed <em>Tetris DS</em>. It was Nintendo coming back to <em>Tetris</em> in 2006 after leaving the franchise to other companies for 8 years. It’s the most impressive <em>Tetris</em> game due to its inventive game modes: it’s chock full of new twists on the good old <em>Tetris</em> formula making it a great game to buy and play. You’re getting a ton of new stuff <strong>and</strong> a great classic mode taking you on a tour of NES nostalgia. That’s how Nintendo develops and markets their games. They made <em>Tetris DS</em> because there was no version of Tetris playable on DS, and they worked really hard on creating new experiences to convince everyone to buy <em>Tetris</em> all over again. It also had a classic mode mandated by Pajitnov and Rogers’ The Tetris Company and it follows the <a href=\"https://tetris.wiki/Tetris_Guideline\">Tetris guidelines</a> to the letter.</p>\n\n<p>But back when Nintendo held the Tetris licence in the ’90s, there was no standardized licensing rules. They had the US console licence so they used it with unrelated puzzle games to gin up their marketing. <em>Tetris Blast</em> to me is the final nail in the coffin; it’s a portable version of the BomBliss concept from the nice people at Bullet-Proof Software but <strong>without</strong> the accompanying classic mode they put in all their other releases. That stings.</p>\n\n<h2 id=\"blast-off\">Blast Off</h2>\n\n<p>Clearly, there was value in bringing the successful <em>Tetris + BomBliss</em> franchise from Bullet-Proof Software (BPS) to Game Boy. A Game Boy is a perfect, dare I say magical device for puzzle titles. There’s just one little problem; while BPS technically owns the portable <em>Tetris</em> licence, they had sub-licensed it to Nintendo. So it’s really Nintendo that owns the worldwide portable licence for <em>Tetris</em>. This next part is a guess but I bet I’m right about this. Bullet-Proof Software released <em>Super BomBliss</em> on Game Boy in Japan without any <em>Tetris</em> intellectual property. The name and the original <em>Tetris</em> concept is not on the cartridge. You can play <em>Bombliss</em>, but not <em>Tetris</em>. The tetrominoes, the blocks themselves, and the falling-block puzzle idea are not copyrightable concepts so it&#8217;s ok. It’s very much a sequel to <em>Super Tetris 3</em> for Super Famicom. Only the original creation of <em>BomBliss</em> was on the cartridge, bypassing the need for the portable <em>Tetris</em> licence. Nintendo of America then liked <em>Super BomBliss</em> enough to bring it over to North America without major changes. They picked it up for publishing and just like they had done with <em>Tetris 2</em>, they slapped the <em>Tetris</em> brand name on the game for good measure. So that’s my theory of how we ended up with <em>Super BomBliss</em> in Japan without <em>Tetris</em>, and the same game in North America with <em>Tetris</em> in name only. How infuriating, and confusing!</p>\n\n<p>Since a puzzle game lives and dies by its gameplay, how is <em>Tetris Blast</em>/<em>Super Bombliss</em>? It’s OK. It offers a different take on the tetromino game, with a focus on bomb blocks. Completing a line detonates the bomb blocks within that line. If you don’t have a bomb block, completing a line does absolutely nothing. All the blocks just stay there.</p>\n\n<p>Since you’re forced to focus on bomb blocks, their detonation range becomes vital to success. Joining multiple bomb blocks together multiplies the range of the later blast, so you work hard to create the largest pile of explosives possible. Unfortunately for me, I’m never sure what size a blast will have. I still don’t get the compounding rules when multiple bomb blocks detonate together. It’s too complicated for my simple tastes.</p>\n\n<p>On the options side, the game has a two-player link cable mode that no one ever played because you need two cartridges, and three single-player options. A strangely named <em>Training</em> mode, which ends up being the endless chase for a high score we all know and love. A <em>Fight</em> mode, where characters appear above your play field and do all sorts of aggravating things. They push blocks, make them fall faster, spawn even more, etc. Once you’ve completely cleared the playfield of blocks, they are defeated and you move on to the next fight with a different creature.</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-10.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-11.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-12.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-13.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-14.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>Finally, we have the meat of the game, and the first mode on offer: <em>Contest</em>. Providing a large list of stages to clear, each is a pre-populated screen of blocks with a difficult setup. You have to simply clear the whole screen of all the blocks, but the challenge comes from the sometimes vicious way the initial blocks are placed. You can play this mode for a long time, and it uses passwords to restore your progress.</p>\n\n<h2 id=\"tetris2-2-the-sequel-to-the-fourth-tetris2\"><em>Tetris 2 2</em>: The Sequel to the Fourth <em>Tetris 2</em></h2>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-15.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>Before we finish this article, I’d be remiss if I didn’t mention <em>Super Bombliss DX</em>, the Japanese-only sequel to <em>Super Bombliss</em>. It’s not much of a sequel, featuring a simple colorized version of the original Game Boy title. To juice up the offering the game now includes a puzzle mode, featuring screens you have to clear with only a limited set of predetermined falling blocks.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p><em>Tetris Blast</em> is fine. My only complaint about the game is its North American title: they should have released it as <em>Super BomBliss</em> over here. A final interesting element is that Henk Rogers and Nintendo had already signed a very similar deal for another game in 1992, three years prior. It had a similar-ish story: BPS wanted to bring to consoles a puzzle concept they had bought from someone else, and Nintendo liked the concept enough to put one of its brands on it. Unlike <em>Tetris Blast</em>, the marketing was better cooked. We’ll look at it next.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ht/dmg-ht-16.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n"},{"id":"mgb-006","date_published":"2022-12-22T00:00:00-05:00","url":"https://gameboyessentials.com/articles/mgb-006","title":"Game Boy Camera","image":"/assets/mgb-006/mgb-006-start.png","banner-image":"/assets/mgb-006/mgb-006-start-social-share-card.png","content_html":"<h1 id=\"game-boy-camera\">Game Boy Camera</h1>\n\n<ul>\n  <li>Japanese release in February 1998</li>\n  <li>North American release in May 1998</li>\n  <li>European release in 1998</li>\n  <li>Published by Nintendo</li>\n  <li>Developed by Nintendo R&amp;D1</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-1.jpg\" width=\"640\" height=\"712\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">You might laugh now but for a short time this thing was impressive.</figcaption></figure>\n\n<h2 id=\"a-camera-in-your-pocket\">A Camera in Your Pocket</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-2.png\" width=\"480\" height=\"432\" alt=\"Game Boy Screenshot\" /></figure>\n<p>Where is the closest camera you own right now? In your pockets? If you’re reading this on your phone, you have a camera looking at you right now, and a whole family of high-quality sensors on the back of the very device with which you’re reading this article. The ubiquity of cameras has thoroughly changed our society, from personal communications to police oversight. The Game Boy Camera came out at a time well before that revolution when a photograph was still an event. The closest peer to this accessory in terms of size and price in 1998 were disposable cameras. <a href=\"https://tedium.co/2018/07/26/disposable-camera-history/\">Costing $10 or lower</a>, disposable cameras were a democratizing force for the camera world. They allowed you to enjoy photography for a very small initial investment. However, they did not change the fundamentals of film cameras; you needed to pay for film development for all the pictures you took, even for duds you were going to throw away.</p>\n\n<p>Digital cameras were already available in 1998. With their rewritable media, they allowed you to take and delete an infinite number of pictures. You were limited only by your digital storage space. In 1998 most cameras saved their pictures on 3 &amp; 1/2-inch diskettes, which meant you could carry a stack of them with you. However, the Sony Mavicas sold for around USD $800 at that time; an expensive sum for very low-resolution pictures. The Game Boy Camera is a peer of those early digital cameras. It was unique amongst digital cameras for its very low price, which came with absurd limitations that severely limited its appeal. We’ll discuss this fascinating Nintendo device in detail, and together we’ll discover what motivated the employees at Nintendo to make the Game Boy Camera.</p>\n\n<h2 id=\"a-greyscale-camera\">A Greyscale Camera</h2>\n\n<blockquote>When Gunpei Yokoi left Nintendo, Hirokazu Tanaka felt betrayed by his departure, and wanted to prove that people at Nintendo could still apply his lessons to create inventive products. The Game Boy Camera and its printer were born of this desire to show the creativity of the developers who stayed with Nintendo. Yokoi accidentally died before the camera was released, and his thanked in the credits.<p><cite>—Translated from <em>L’histoire de Nintendo Volume 4</em>, P. 153.</cite></p></blockquote>\n\n<p>Gunpei Yokoi is best remembered as the father of the Game Boy, since he was the leader of R&amp;D1 where the device was developed. When Yokoi left Nintendo in the mid ’90s, Hirokazu <em>Hip</em> Tanaka, a music composer inside the company, saw the Game Boy Camera project as a way to prove his and his colleagues’ worth. They had the engineers to develop future iterations of the Game Boy, but they had lost their superstar toymaker. Yokoi was famous for his work at Nintendo; a rare privilege only bestowed back then upon him and Shigeru Miyamoto. Miyamoto was a video game developer but Yokoi was something else entirely. He was an engineer and an inveterate tinkerer. Ultimately, he was Nintendo’s star toymaker. Yokoi had started at Nintendo when it was still a playing card company, and his wonderful designs gave Nintendo a solid footing when it diverted in toymaking. The stories around Yokoi’s mechanical creations were legend. With Yokoi’s departure, the R&amp;D1 division was further divided into a hardware and a software section. Okada Satoru was put in charge of the hardware, and no one internally could doubt his ability to deliver good products, since he was the person who defined all the important details of the Game Boy. An engineer who started at R&amp;D1 working for Yokoi, he went against his boss during the Game Boy’s development. Yokoi wanted the Game Boy to be similar to a Game &amp; Watch that would be popular for a <em>season</em>. Perhaps a machine that could only play a limited set of predetermined games. Yokoi had the mentality of a toy-maker; he focused on building toys that would grab children’s attention for a moment before they moved on to something else. It was Okada that wanted a hardware platform that developers could fully program. Something where our waning attention is focused on the cartridges, not on the hardware. Simply put, a portable Famicom. Yokoi relented and let Okada build the Game Boy his way. This highlights the trustworthiness and competence of Okada; he would continue to deliver portable success after portable success until his retirement from Nintendo in 2012. Back in 1998, he had not yet proven himself, and was certainly not known for his toymaker mentality. Making a digital camera for the Game Boy might prove that Nintendo R&amp;D1 could still make interesting toy-like accessories without Yokoi.</p>\n\n<h2 id=\"limited-hardware\">Limited Hardware</h2>\n\n<p>With our modern point of view, <em>Game Boy Camera</em> is a complete joke. It can seem like no one could tolerate its low image quality and that it must have been a monumental flop. The reality is far from that. Looking back at the <em>Game Boy Camera</em>’s release in 1998, the device enjoyed a somewhat warm reception.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-3.jpg\" width=\"612\" height=\"1270\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><a href=\"https://books.google.ca/books?id=3Bxy4y0umo0C&amp;pg=PA12\">Popular Science, July 1998, p. 12</a></figcaption></figure>\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-4.jpg\" width=\"1812\" height=\"1178\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><a href=\"https://books.google.ca/books?id=Nv8DAAAAMBAJ&amp;pg=PA11\">Boys’ Life, September 1998, p. 11</a></figcaption></figure>\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-5.jpg\" width=\"1630\" height=\"612\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><a href=\"https://archive.org/details/bub_gb_JywEAAAAMBAJ/page/n157/mode/2up\">Vibe, August 1998, p. 148</a></figcaption></figure>\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-6.jpg\" width=\"950\" height=\"1232\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><a href=\"https://archive.org/details/GamePro_Issue_109_August_1998/page/n31/mode/2up\">GamePro, August 1998, p. 30</a></figcaption></figure>\n\n<p>Yes, the pictures it takes are laughably bad, with a ridiculously low 128 by 112-pixel resolution. The thing is only good at taking pictures of large things (like a head or a dog) from way up close. Don’t even try to take a picture of a distant landscape view. To top off the mediocrity, pictures have no colour, being only available in the same four shades as your Game Boy. However, you have to look at what digital cameras were capable of doing and at what price to understand the device’s appeal in 1998. Of course, something like the <a href=\"https://global.canon/en/c-museum/product/dslr777.html\">Canon EOS D2000</a> existed, but this 1728 by 1152 resolution professional device retailed for over $15,000 USD. It was also a bleeding edge trailblazer; it was the first digital camera somewhat respected by professionals. We have to look downmarket to find peers of our little puny <em>Game Boy Camera</em>. For example, Minton made a crappy OEM camera that was re-badged by countless companies. <a href=\"https://www.digitalkameramuseum.de/en/cameras/item/jenoptik-jd11-entrance\">It came with a 640 x 480 pixel sensor and sold for around $149 USD</a>. It’s a much better device at three times the price but it is still a terrible camera compared to modern standards.</p>\n\n<p>When you look at it, the Game Boy Camera is more akin to a toy than a digital camera. We’re lucky, we have a new camera toy from 1998 to compare it against.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-7.jpg\" width=\"1000\" height=\"669\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">BarbieCam!</figcaption></figure>\n\n<p><em>Barbie Photo Designer</em> was announced in September of 1998, obviously for the upcoming Holiday season and was a package consisting of the digital camera and its accompanying PC software. It retailed for $69.99, a shockingly low price at first glance for a digital camera and PC software. Upon closer examination the device is not too good to be true. Although it took colour photos, it is very close to the Game Boy Camera in terms of resolution: 160 by 120 pixels. That’s minuscule.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-8.jpg\" width=\"640\" height=\"480\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">An example of a BarbieCam photo. This photo was taken with the later Nickelodeon model, which is the same camera. Photo courtesy of <a href=\"https://www.superkids.com/aweb/pages/reviews/camera/1/nick/merge.shtml\">Superkids.com</a>.</figcaption></figure>\n\n<p>It was a severely limited device. It’s a digital camera but it doesn’t have a screen or removable media. All the beautiful benefits of digital photography come from those two things. Without a screen you can’t know if the picture you took is any good and without removable media you can’t keep taking pictures by swapping SD cards or whatnot. You’re stuck with the six pictures it can keep in its internal memory.</p>\n\n<p>The device’s only options are taking pictures or deleting all the meagre six pictures without ever looking at them. Once you connect to a PC, you can very slowly transfer your pictures and finally see them for the first time. I imagine most kids ended up using the device in their home fairly close to their PC due to those extreme limitations.</p>\n\n<p>Moving on to the software, both companies chose to focus on offering games with the pictures you took to complement their low-resolution cameras. I guess there aren’t many ways to make a bad quality camera <em>fun</em>. When you compare the disadvantages of <em>Barbie Photo Designer</em> and <em>Game Boy Camera</em>, that’s where you understand that the portability, viewfinder and memory for 30 pictures make the <em>Game Boy Camera</em> a competitive package in this brand new toy camera category. This category was hotter than you think as well: <em>Barbie Photo Designer</em> sold 300,000 copies in the US in its first year on the market and the <em>Game Boy Camera</em> sold a million copies in Japan. However, the market would quickly get saturated with copycats, and by the mid-2000s digital cameras had come down in price enough that a toy digital camera became a niche item. Parents seemingly bought their kids cheap full-fledged cameras instead.</p>\n\n<h2 id=\"terrible-software\">Terrible Software</h2>\n\n<p>I’ll say it upfront; I don’t like the <em>Game Boy Camera</em> software. It’s a mess. It features so many baffling interface decisions. People have called it quirky. I have a different word for it: bad.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-9.jpg\" width=\"2100\" height=\"1488\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><a href=\"https://archive.org/details/nintendofuntographyguide/page/n5/mode/2up\">The Nintendo Game Boy Camera Funtography Guide provides a full map of the software</a>.</figcaption></figure>\n\n<p>You can immediately see that there are a lot of things you can do. Outside of <em>Mario Paint</em>, I can’t think Nintendo had ever made a user interface this complex before.</p>\n\n<p>Upon starting the device, you’re presented with a start screen with photos of someone in a Mario costume. This shows one conceit of the software; that it will sometimes use real photos taken with a <em>Game Boy Camera</em>. It’s not a full design choice. Large sections of the interface use drawn art to represent characters. If you get an idea like that, I’d expect them to use it fully.</p>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-10.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n\n<p>We get a complete rookie mistake on the main screen of the interface: they never indicate you can press the Start button to access settings. So on a screen with three clearly written choices, you actually have four. Let’s jump into the worst segment of the device; Play. When you go into this segment, a game of <em>Space Fever II</em> immediately begins. Two enemies drop down from the top of the screen, with letters written on them. Now, those enemies are actually the selection method for the <strong>other</strong> games you can play. So if you shoot those lettered enemies, you start another completely different game. However, if you shoot none of them, or miss your shot, <em>Space Fever II</em> will begin. Imagine that; a selection menu with a time limit. Upon starting those other games, you get astoundingly different screens to navigate their respective options. There is no general logic. The whole UI is a mad house.</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-11.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-12.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-13.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>The first game is a copy of the first Game &amp; Watch title, <em>Ball</em>. We’ve discussed it previously when talking about <a href=\"/articles/dmg-agga/\"><em>Game Boy Gallery</em></a>. This version is using different sprites for the body, and allows you to use pictures for the face. The second game is a small DJ toy that I cannot understand for the life of me. The final game, which you unlock upon completing <em>Space Fever II</em>, is a running game where you mash buttons. Once again, you can put your face on the character you play.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-14.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">The Shoot menu</figcaption></figure>\n\n<p>Upon going to the Shoot segment, you get what is supposed to be a parody of an RPG’s battle screen, with pixel art of people standing in as your enemies. Since you just came from a screen where someone in a Mario suit was dancing about, the joke falls flat immediately. The battle screen includes a run command, leading to an infamous joke played on the user.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-15.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">What are you running away from? BAD UI!</figcaption></figure>\n\n<p>That jokey screen is meant to tell the player that they can’t run away, this isn’t an RPG, just a parody of one. But the very real face has those hideous drawings added on them. It’s just so out of place.</p>\n\n<p>The two most sedate and reasonable segments of the software are the viewfinder screens and the photo album under View. The picture taking features all the controls around the viewfinder, arranged in an intelligent manner that focuses on quick adjustments. The photo album navigation is pretty straightforward, and once you reach the single picture view, all the options are also arranged around the picture. If you dig deep enough, you can find drawing tools that provide you with a barebones <em>Mario Paint</em>. You could take a picture of a white wall and just draw on your Game Boy. You don’t get the benefit of a mouse, but it’s a fun, well designed little drawing utility in a sea of terrible UI.</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-16.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-17.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-18.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-19.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-20.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-21.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>The camera has far more tricks up its sleeve, and they are all bespoke tools that are hard to grasp because their user interface is not standardized. All in all I think part of the mess is explained by the number of companies who worked on the project. Employees from Creatures (formerly Ape), Game Freak, and R&amp;D1 are all credited. This is a complete guess, but I think employees completed different segments of the software alone and those were added together with no regards for consistency. Even Jupiter, the company mostly known for Picross, is thanked in the credits but they might have supported in other ways like Quality Assurance. None of the craziness in the software was featured on the box; the box is very sedate, even in Japanese. The ads themselves, in both Japan and the US, focus heavily on the power of easy photography (duh) and the fun that can be had with the stamps implemented in the painting tools of the photo album.</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-22.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_gb gallery\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-23.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure></div>\n</div>\n\n<p>We got a surprising revelation just recently in 2020 that highlights the poor user interface design. As a part of the <em>Gigaleak</em>, a <a href=\"https://en.wikipedia.org/wiki/Nintendo_data_leak\">massive lotcheck of Game Boy titles was uncovered</a>. Lotchecks, in internal Nintendo parlance, are lists of ROM ready for use in cartridges. They’re the <a href=\"https://en.wikipedia.org/wiki/Software_release_life_cycle#RTM\">golden masters</a>. Amongst this lotcheck was <em>Hello Kitty Pocket Camera</em>, a special version of the camera dedicated to whom else but Hello Kitty. This whole special version of the Game Boy Camera is 100% complete, yet was <strong>never released</strong>. No one outside Nintendo had seen this software before 2020. When you load up this <a href=\"https://archive.org/details/hello-kitty-pocket-camera-japan-rc-2\">golden master</a> in an emulator you can see all the beautiful differences. While all the camera functionality from the released version is present, nothing from the released Game Boy Camera user interface was reused. I’m not versed enough in Japanese to explore the interface in detail but my cursory look revealed a much improved UI. For example, if pressing Start sends you to another screen, you see a mention from the Hello Kitty UI. All the creepy pictures and inscrutable in-jokes have been removed. It’s clear the Hello Kitty UI was their second attempt at a <em>Game Boy Camera</em> interface, and this second crack at the problem gave them enough time to finally make a workable interface. It’s just a shame they never released it.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-24.jpg\" width=\"846\" height=\"938\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">We know what the hardware could have looked like <a href=\"https://www.youtube.com/shorts/koyGCLDp8nU\">from a Pocket Hello Kitty flyer</a>.</figcaption></figure>\n\n<h2 id=\"game-boy-camera-gets-a-receipt-printer\">Game Boy Camera Gets a Receipt Printer</h2>\n\n<p>Nowadays, people are satisfied that their photos live online, but in 1998, everybody expected to get printed copies of every picture they took. You could trade pictures with another <em>Game Boy Camera</em> using a Link Cable, but keeping your pictures imprisoned inside a <em>Game Boy Camera</em> was a non-starter; Nintendo wanted to provide printing capabilities. While Nintendo could have answered with a stereotypically Japanese solution by putting printing kiosks in combinis all over Japan, leaving the rest of the world to fend for itself, they instead developed a portable printer one could easily buy alongside the camera. This was a great idea in practice, and a marked improvement over <em>Mario Paint</em>. I feel like <em>Mario Paint</em> never reached its full potential because it never had any print capabilities outside of <em>record your art on a VHS tape and figure something out from there</em>.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-25.jpg\" width=\"2515\" height=\"3473\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">The Game Boy Printer.</figcaption></figure>\n\n<p>So as with the camera came the Game Boy Printer. Connected through the link cable port, running with a whopping six AA batteries and <a href=\"https://christmas.musetechnical.com/ShowCatalogPage/1998-JCPenney-Christmas-Book/0547\">retailing for the relatively high price of $60 upon release in 1998</a>, the device uses thermal paper just like your receipt at the grocery store. Just like we discussed earlier with the camera, Nintendo knew they had to compensate for their bargain bin technology, so they wisely included thermal paper with a sticking back. This turned bad pictures into <em>collectable pictures</em>. You could stick your pictures in a book, collect pictures of different plants or animals, stick pictures of people on their books, etc. Selling paper with a sticky back was a genius idea to compensate for a poor printing quality; and the printing quality was indeed bad. No one goes to a thermal printer for a beautiful, detailed print. It’s a cheap way to get something on paper fast. It will work fine for fun prints to share in the moment, but you’re not going to preserve your pictures long-term with those prints. Just like your receipts the prints fade with time. So if you have any old printed pictures from way back, they’ll be very faded now, due to the thermal paper technology.</p>\n\n<p>The Game Boy Printer enjoyed a life outside its release with the <em>Game Boy Camera</em>. A few games included the ability to print some stuff; banners, high scores, medals. <em>Pokémon Yellow</em> allowed you to print the content of your PC boxes for example, providing potential relief from all the box shuffling needed to manage your captured Pokémons. When I look at an <a href=\"https://gamefaqs.gamespot.com/gameboy/916375-game-boy/faqs/35200\">exhaustive list of what can be printed</a>, I find nothing impressive. Add the high price of the printer coupled with its large appetite for batteries and I feel like anyone who bought the printer was disappointed by its usage outside of <em>Game Boy Camera</em>. I didn’t buy it, and still do not own one; when I bought my <em>Game Boy Camera</em>, I did so for $20, a year after its release in the fall of 1999. I skipped the printer, which still retailed for its full price somehow. I don’t feel like I’m missing anything, especially since the Game Boy Printer is basically a repurposed receipt printer mechanism.</p>\n\n<h2 id=\"accessing-your-pictures\">Accessing Your Pictures</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-26.png\" width=\"480\" height=\"432\" alt=\"Game Boy Screenshot\" /></figure>\n<p>If you’re like me, you own a <em>Game Boy Camera</em> with pictures that are decades old at this point. You might even have pictures that you consider valuable stuck on there. My sister had taken pictures of our family dog when he was a puppy. I wanted a way to extract them and get copies on my Mac. Having already explained how a Game Boy Printer is a poor fit for preservation, other options were needed.</p>\n\n<p>Five or ten years ago, limited options existed but we now have a plethora of methods to extract pictures from a Game Boy, from the handmade low-run device like the <a href=\"https://gameboyphoto.bigcartel.com/product/bitboy\">BitBoy</a> to the exquisite FPGA high-quality device like the <a href=\"https://www.analogue.co/pocket\">Analogue Pocket</a>. You also have the <a href=\"https://www.epilogue.co/product/gb-operator\">Epilogue GB Operator</a> a cartridge port you somehow plug into your computer to play those games, and something like the <a href=\"https://github.com/MattGrayYes/Game-Boy-Camera-Fast-Wifi-Adapter\">Game Boy Camera Fast Wifi Adapter</a> a project you assemble yourself using a bunch of parts that you fit inside a 3D printed case. Basically it’s a <a href=\"https://www.gbxcart.com/\">GBxCart RW</a> coupled with a Raspberry Pi Zero. There are even more options if you want to do a bit of research. To solve the problem for me, I used something I already owned. Since I’m cheap, and didn’t want to spend money on a bespoke solution I’ll use once, I decided to use the little <a href=\"https://github.com/mofosyne/arduino-gameboy-printer-emulator#quick-start\">Arduino board I already own to transfer my pictures</a>. This meant cutting up a Game Boy link cable and identifying each wire with continuity. Not the easiest thing, but it was a reasonable task for an amateur tinkerer like me. I was able to adequately mark the required wires, make new ends (always be sure to plug the ground wire in the right spot) and follow the instructions to load the software correctly and extract the data from the serial monitor. It was immediately successful, with my only issue being the extremely crappy software for the Arduino IDE. They should be ashamed of how many interface bugs they have in their software. Anyway, I encourage you to get your pictures extracted if you have any of sentimental value. That cell battery in there won’t last forever.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-27.png\" width=\"480\" height=\"432\" alt=\"Game Boy Screenshot\" /></figure>\n\n<h2 id=\"never-the-smallest\">Never the Smallest</h2>\n\n<p>I had read on Wikipedia that the 1999 edition of the <em>Guinness Book of World Records</em> deemed the <em>Game Boy Camera</em> the world’s smallest digital camera. I wanted to read this mention in Guinness directly, so I headed to the Internet Archive’s controversial book rental system to read the 1999 Guinness book. <a href=\"https://archive.org/details/guinnessbookofre00newy/page/294/mode/2up\">Here is the paragraph talking about the Game Boy Camera on page 294.</a></p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-28.jpg\" width=\"1158\" height=\"876\" alt=\"Picture\" /></figure>\n\n<blockquote>\n  <p>SMALLEST CAMERAS In 1998, Nintendo’s Game Boy, which was launched in 1989 and has sold more than 60 million units worldwide, was reinvented as a camera and printer. The digital still camera cartridge sits on top of the Game Boy (as seen at left) and can take and store up to 30 low-resolution black and white photos. The camera comes with three games that allow players to create characters using photos. The printer can then produce small prints or stickers. In 1997, the company reduced the size of the Game Boy and introduced the Game Boy Pocket, and a color version of the Game Boy is due to be launched at the end of 1998. The world’s smallest pinhole video camera is the PC-21XP, sold by Supercircuits Inc. The CCD element occupies only ¼ square inch but has a 295,000-pixel array that outputs 380 video lines. It can see in low-level lighting of 0.5 lux. The overall unit measures 115/100 × ½ inch and can run for up to five hours on one PP3 battery.</p>\n</blockquote>\n\n<p>As you can see reading it, no mention is made of the Game Boy being the smallest of anything. You could perhaps read the description of the PC-21XP described as the world’s smallest pinhole video camera and think this applies to the <em>Game Boy Camera</em>. Unfortunately, the cartridge does not use a PC-21XP as its camera element. The camera uses a <a href=\"https://people.ece.cornell.edu/land/courses/ece4760/FinalProjects/f2012/qs44_twc55/qs44_twc55/datasheets/MITSUB_image_sensor.pdf\">Mitsubishi M64282FP CMOS image sensor</a>. So the book actually mixes two subject matters into one paragraph, and uses the confusing title <em>Smallest Cameras</em>. You could still read the paragraph and believe they simply did not directly write it, but the book actually names the Panasonic NV-DCF2B as the world’s smallest digital camera with a viewfinder just one page before. Reading the rest of the section on gadgets, it’s clear the paragraph is just meant to describe an interesting device. Two other devices which are not record-holders of anything are later mentioned in the same manner as the <em>Game Boy Camera</em>: a lollipop that plays music and a 360-degree television.</p>\n\n<p>To be 100% sure, I contacted Guinness by email and they confirmed that the <em>Game Boy Camera</em> was <strong>never assigned any record</strong>. Case closed: the <em>Game Boy Camera</em> was never the world’s smallest anything. Any mention of a Guinness record, even when properly transcribing what is written by Guinness, should be questioned. It’s always been a book of factoids and weird trivia instead of a serious reference. Reading anything related to technology feels like you’re reading a collection of statements pulled straight out from press releases. How can anyone validate the record for the <a href=\"https://archive.org/details/guinnessbookofre00newy/page/274/mode/2up\">most recyclable car</a> beyond the car company’s own statement? Couple that with the broken relationship between the speed running community and Guinness, and it shows a company incapable of understanding video games. Case in point, Guinness removed Billy Mitchell’s gaming records the year after his cheating was revealed. So far so good, but they somehow <a href=\"https://www.guinnessworldrecords.com/news/2020/6/a-statement-from-guinness-world-records-billy-mitchell-621053\">reinstated those same records two years later</a>, <strong>after</strong> he had been unequivocally proven to have lied about his achievements. He had already been <a href=\"https://arstechnica.com/gaming/2018/04/premiere-game-scoreboard-bans-billy-mitchell-in-donkey-kong-cheating-scandal/\">banned from both serious <em>Donkey Kong</em> score-keeping organizations</a>. This puts Guinness under a very bad light; they have no qualms crediting records to a cheater. They also <a href=\"https://youtu.be/0twDETh6QaI?t=3627\">assigned ultra-specific records to Tommy Tallarico</a> in a clear example of their <a href=\"https://www.npr.org/sections/money/2017/09/20/552203402/episode-795-is-record-breaking-broken\">pay-for-play record scheme</a>. I’m not going to mention Guinness ever again without some heavy research.</p>\n\n<p>The wrong information about the <em>Game Boy Camera</em> record has been on Wikipedia since it was added by an <a href=\"https://en.wikipedia.org/w/index.php?title=Game_Boy_Camera&amp;diff=prev&amp;oldid=219108575\">anonymous contributor in June 2008</a>. You can now find this fake fact mentioned in tons of articles online, on Wikia, probably in a bunch of books. Look at <a href=\"http://www.digicamhistory.com/\">Digicam History</a> and <a href=\"https://www.digitalkameramuseum.de/en/\">Digitalkameramuseum</a> for example, two old websites cataloguing the pre-1999 history of digital cameras who both mention the non-existent record. I’ve emailed both to have them remove it, but I predict I will see this false information until I die.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>When I was in high school, I would bring my Game Boy to play between classes or to show my closest friends the latest games I was playing. No one really gave a second thought that I brought my old Game Boy to school. When I ended up buying a <em>Game Boy Camera</em>, it felt natural to show it to my friends. I was in for a rude lesson. When I brought the <em>Game Boy Camera</em> to school, it immediately caused a ruckus. When they discovered that my Game Boy could take a picture and immediately show it on its screen, my whole class congregated around my Game Boy, rudely taking it from me. People were suddenly taking selfies, way before the concept was attached to a word, and fighting over who was going to take a picture next. It turned into a pandemonium of excited teenagers screaming at one another to have the camera. A classmate even shoved the camera down her shirt to take a picture of her cleavage. With hindsight, I saw in those five minutes the natural excitement for all the social sharing of pictures we now have in the era of the smartphone. I saw selfies before the word had left Australia, the pouty lips people make when taking those selfies, the incessant sharing of inane pictures you now see on stuff like Snapchat, and even the burgeoning concept of sexting, all with my Game Boy!</p>\n\n<p>That’s how starved for cameras my generation was.</p>\n\n<p>I vividly remember not being allowed to touch the family camera; I was told I would probably break it. Everyone I knew had more or less the same experience, where a camera was an expensive tool reserved for adults. Remember, it cost money every time you pressed the shutter button. You also had to send the film to be developed, which meant that a stranger looked at every picture you took. It was common to talk about the weirdness of technicians looking at your pictures. That put social pressure on what you could shoot. I totally understand that classmate realizing she could snap her cleavage with abandon now that she knew no stranger would see the picture. The appeal of a cheap camera you could play around with without worry was hella powerful.</p>\n\n<p>With class about to start, the teacher getting angsty, and me wanting to get my beloved Game Boy back, I ended up in a tussle and pushed a classmate trying to get it back. Falling down, he dropped his glasses and they broke on the ground. That’s right kids; <em>Game Boy Camera</em> led me to violence and got me in trouble with my school principal! I was so ashamed I hid the whole thing from my parents and paid for the repair of his glasses with my own money.</p>\n\n<p>I wouldn’t blame you if you never want to read anything from me again due to this Game Boy transgression.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/mgb-006/mgb-006-29.png\" width=\"480\" height=\"432\" alt=\"Game Boy Screenshot\" /></figure>\n"},{"id":"dmg-ky","date_published":"2022-11-28T00:00:00-05:00","url":"https://gameboyessentials.com/articles/dmg-ky","title":"Kirby’s Dream Land","image":"/assets/dmg-ky/dmg-ky-start.png","banner-image":"/assets/dmg-ky/dmg-ky-start-social-share-card.png","content_html":"<h1 id=\"kirbys-dream-land\">Kirby’s Dream Land</h1>\n\n<ul>\n  <li>Japanese release in April 1992</li>\n  <li>North American release in August 1992</li>\n  <li>European release in 1992</li>\n  <li>Published by Nintendo</li>\n  <li>Developed by HAL Laboratory</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-1.png\" width=\"693\" height=\"800\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">Pink is in.</figcaption></figure>\n\n<h2 id=\"a-little-piece-of-perfection\">A Little Piece of Perfection</h2>\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>Close your eyes for just a moment. Imagine a quiet green plain with a comforting wind slowly swaying the grass back and forth. Near the horizon there are rose-coloured mountains. Just go along with it, rose mountains are normal. Taking in the heat of the sun’s rays (the sun has a face, once again it’s totally normal), in the swaying grass is the most serene and sweet character our imagination can muster. It’s asleep, lightly snoring as its basking in the warm glow of the beautiful day. Just like the mountains it’s pink. It’s Kirby. A pink ball of niceness with shoes and cute stubby arms. Its only personal flaw is its voraciousness, but it manages to make that cute too.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-3.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n\n<p>Nowadays, the character’s cheery attitude has been turned into a bit of an ironic in-joke. He’s the cutest, with him being pink and always happy, but he’s also the most badass! The ultimate evil of the universe managed to destroy every single character in the introduction of <em>Super Smash Bros. Ultimate</em> but Kirby survived all that. <em>Because, you see, it’s a secret badass</em>. However, the character was initially created without irony; the gumdrop aesthetic was honest. Kirby was not secretly all-powerful even though it looked harmless. There was no subversion of our expectations. In fact, the aesthetic was a core marketing element of Kirby’s first game. This evolution of Kirby’s character can perhaps be explained by the disconnect between the world of Kirby and the actions it performs. All the verbs at your disposal in <em>Kirby’s Dream Land</em> are indistinguishable from a mature, violent side-scroller platformer like <em>Contra</em> if only Bill and Lance could fly.</p>\n\n<p>SOAR.</p>\n\n<p>DEVOUR.</p>\n\n<p>EMPOWER.</p>\n\n<p>SHOOT.</p>\n\n<p>ATTACK.</p>\n\n<p>DEFEAT.</p>\n\n<p>You relentlessly move forward mercilessly destroying your enemies by swallowing them and throwing their remains at other enemies. The visuals make it a fun jaunt and everyone is happy and cute. Isn’t that wonderful, and essential?</p>\n\n<h2 id=\"setting-the-stage\">Setting the Stage</h2>\n\n<figure class=\"figure figure_gb float right\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-4.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>Kirby is the quintessential Nintendo character but it is not a Nintendo creation. It is not even owned by Nintendo; HAL Laboratory owns the rights. How can Kirby be a quintessential Nintendo icon if it’s owned by another company?</p>\n\n<p>HAL Laboratory always had a close relationship with Nintendo going all the way back to the Famicom. When the console was initially conceived, Nintendo had few programmers to make games for its first console with interchangeable software. The savvy people working at Nintendo turned to the people of small company HAL who were able to help out, particularly due to one of their younger programmers, Satoru Iwata. He, along with his other colleagues, were commissioned by Nintendo to work on seminal Famicom titles like <em>Golf</em>, <em>Balloon Fight</em>, and <em>Pinball</em>. Their contributions stayed hidden; neither their company nor their names appeared on those Nintendo titles. When the ’90s rolled around, however, HAL had gotten in an impossible position. Their prestige 1991 Famicom game <em>Metal Slader Glory</em> was unprofitable <a href=\"https://www.vice.com/en_us/article/ne3mjd/hal-laboratory-metal-slader-glory-nintendo-history\">and they were caught in a financial death spiral</a>. Nintendo’s executives saw potential in HAL and bailed the company (presumably for a controlling stake) but asked that Satoru Iwata, who by this point had gotten a great reputation as a manager, <a href=\"http://shmuplations.com/iwata/\">become the new company president</a>. All in all, a quintessential Hiroshi Yamauchi move. This would turn out to be the most important personnel move Yamauchi ever did; Iwata got so respected he ended up succeeding Yamauchi at the helm of the whole of Nintendo a decade later.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-5.jpg\" width=\"493\" height=\"405\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\"><em>Mingle Magnet</em> for Wonderswan</figcaption></figure>\n\n<p>Nintendo has tightened its control over HAL Laboratory ever since that fateful 1991 death spiral with the last work of HAL not published on a Nintendo console, <em>Mingle Magnet</em> for Wonderswan, released in 1999. They now seem to be a fully owned subsidiary which makes them what is commonly termed a second-party developer. However, back when they made <em>Kirby’s Dream Land</em> they were in the process of being bailed by Nintendo. Masahiro Sakurai talked about his experience of working for a company going through bankruptcy in his <a href=\"https://m.youtube.com/watch?v=khJa2vIW0xY\"><em>Kirby’s Adventure</em> development video on his YouTube channel</a>. Kirby is the child of this marriage of convenience.</p>\n\n<h2 id=\"creating-a-placeholder\">Creating a Placeholder</h2>\n\n<p>The father of Kirby, Masahiro Sakurai, was 19 when he created Kirby. He had only one other game credit under his belt, also with HAL; the interesting but obscure Game Boy shooter <em>Trax</em>. Since Nintendo now had a hand in the management of HAL, Hiroshi Yamauchi, the ruthless Nintendo president, decided to task them with a small project to steer HAL back towards profitability. He wanted them to make a Game Boy platformer starring a new mascot. Yamauchi’s mission was accomplished with aplomb; from the moment you open your Game Boy to play <em>Kirby’s Dream Land</em>, Kirby is a fully realized mascot in a game accessible to everyone.</p>\n\n<p>The title screen features a lineup of multiple Kirbys jumping, making faces, doing a bit of moonwalking, generally being cute as hell. You immediately get a sense of joy emanating from this little character. Aside from wondering if there are multiple Kirbys in the world (an unresolved mystery we’ll get back to shortly), you want to buy a plush Kirby just to hug it. As a first introduction its knocking it out of the park. Everything that makes Kirby lovely is there from the first moment except for its seminal copying ability which would appear in the second game. The game even manages to introduce musical themes that are still used today. As a matter of fact the Kirby series has not only kept its songs, it kept its composer; Ishikawa Jun has always been the main composer for Kirby titles. I also want to give kudos to the sound designers for the very fun aspirating sound. Kirby sounds exactly like a vacuum, and it’s perfect. Not everything is perfect but they clearly spent a lot of energy where it mattered for this game.</p>\n\n<h2 id=\"a-short-look-at-the-game-that-reflects-the-brevity-of-the-game\">A Short Look at the Game That Reflects the Brevity of the Game</h2>\n\n<p>Here are some elements of the game’s design that reflect a thoughtful design process and that will enhance your experience. If you play the game, and wonder why it’s such a great little experience, then these choices explain the great fun you’re having. It’s incredible that so many magnificent design decisions were taken by a team led by such a young developer.</p>\n\n<p>Graphics on Game Boy require a lot of foresight and planning to work well on the original Game Boy screen because its ghosting can make complicated graphics too difficult to see. <em>Kirby’s Dream Land</em> showcases how to create beautiful graphics that still limit the amount of ghosting and keeping the game legible in all scenarios. It amounts to using a healthy dose of whitespace with discrete elements of characters and scenery drawn with thick borders but sparse internal details. Just like Kirby, most everything in the game is a shape with very little internal detail.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-6.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n\n<p>Another element that really helps the fidelity of Kirby’s world is the belt scrolling. Belt scrolling describes a locked screen able to move in only one direction with the other axis locked. The screen can move left to right but it will not move up or down and it will not reverse either. If you imagine a level as if it’s painted on an industrial belt, the crank to turn the belt can only go in one direction. Since you’re only scrolling in one plane at a time (most often in this game from left to right) the ghosting is limited to streaks going in one direction. That helps a lot since you get accustomed to the predictable unidirectional ghosting. You don’t think about it but it makes a big difference that ghosting streaks are mostly coming from a single direction.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-7.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">Every stage starts with a short scene of Kirby getting his comeuppance from benign situations. Here Kirby runs after a butterfly that gets its buddies to fight back.</figcaption></figure>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-8.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">Kirby tries fishing; it gets a mouthful of its own hook and falls in the water.</figcaption></figure>\n\n<p>There is this saying amongst video game developers that <a href=\"https://www.designer-notes.com/?p=369\">if given a chance players will optimize the fun out of a game</a>. What this means is that if developers give players a cheesy strategy players will use that advantage even if it makes the game boring to play for them. Developers have to account for this fact when designing a game and eliminate any strategies that make playtime boring. Flying in a platformer definitely falls under that axiom; what fun is there in a game where you can fly above every obstacle and eliminate any challenge? You might have fun for a couple of minutes due to the novelty but the appeal wears off quickly. <em>Super Mario World</em> is the golden reference when it comes to a platformer with flying elements. You can fly in the game which could potentially ruin the fun and make the game boring. To keep the game somewhat fun even if you skip levels with the cape you are required a lot of effort to maintain flight. It’s not a simple one button process, meaning you will always have to do something. I don’t feel it’s a perfect solution since a repetitious task is never as fun as running through a gauntlet designed by the very best level designers in the world.</p>\n\n<p><em>Kirby’s Dream Land</em> has Kirby flying indefinitely if you inhale air. It is a dead simple one-button move, which could definitely ruin the fun. Future games in the series will slow down Kirby’s flight speed and agility, and limit your flight time. There are no such limitations here; Kirby is legitimately flying fast by flapping its tiny little arms. However, the game is not optimizing the fun out of the platforming like <em>Super Mario World</em>.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-9.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n\n<p>How? The solution to the problem is actually wonderful because it uses the limitations of the Game Boy as a positive. Since the Game Boy has a limited resolution the play area in a platformer is small. In the case of <em>Kirby’s Dream Land</em>, the play area is around eight Kirbys tall. Compared to a game on a CRT that’s a very small play field above your characters’ head. The smaller play field, which cannot scroll up, keeps the player involved because Kirby cannot fly very high. You just hover close to the ground always under the threat of a jumping enemy hitting you. The game also includes many enemies who loiter around the top of the screen, giving you obstacles to avoid even when you’re in the air. So the small Game Boy screen actually makes a game more fun for once!</p>\n\n<h2 id=\"unique-in-scale-and-scope\">Unique in Scale and Scope</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-10.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>The game is simple and short, and unique in that regard. There are so few platformers like it. <em>Kirby’s Dream Land</em> does not have a save function but it doesn’t matter. You can easily clear the game in less than an hour. Anytime I think of a short platformer all the titles that come to mind are on Game Boy, with the exception of <em>A Short Hike</em>. I ask you, what is wrong with a game you can finish in an hour? Is there anything fundamentally wrong with an hour-long game? There isn’t, it’s simply a different artistic object. Not every platformer has to be extremely long, not every game has to stretch into infinity until you’re bored out of your head. Even the further adventures of Kirby would turn into long games immediately after this game with <em>Kirby’s Adventure</em> being a long-ass title requiring many hours to complete. It’s unfortunate that we were collectively offered ever longer games. We could have had tons of fun platformers like <em>A Short Hike</em> for decades but instead everything had to be way too long all in the name of value. Ultimately, I hope we see more platformers akin to <em>Bowser’s Fury</em> in the future; a clear concept that’s fun for around two hours. I sincerely hope that it is the future of platformers as a genre; <em>Mario’s Odyssey</em> was way too long and meandering. Platformers could benefit from the unique experiences that a short puzzle game like <em>Unpacking</em> provides.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-11.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">If you want to play the game and you want a more involved challenge, try the bonus mode. It’s properly difficult.</figcaption></figure>\n\n<h2 id=\"marketing-meets-aesthetic\">Marketing Meets Aesthetic</h2>\n\n<p>There’s a link between the game’s presentation and its difficulty. Because it’s a short and easy title, it needs to tell potential buyers subconsciously. <em>A Short Hike</em> does it by literally being called a short hike. There’s no question that this game is not meant to be difficult or long. <em>Kirby’s Dream Land</em> features a cute character, usually a way to say that a game is for younger players. It also used the word dream in the title, which shouldn’t imply something challenging. <em>Kirby’s Nightmare Hellscape</em> calls to mind something much different: a difficult gauntlet with demons and guns. Basically, I think of <em>Doom</em>. I guess they ended up putting the word nightmare in the title of the remade version of <em>Kirby’s Adventure</em> for Game Boy Advance, <em>Kirby: Nightmare in Dream Land</em>, but by that point Kirby was a well-known and popular character. They didn’t need to signal as strongly what to expect with the marketing. <em>Kirby’s Dream Land</em> was a smash hit in no small part due to its marketing and themes. It’s an easy platformer kids will love but it’s so well made that everyone should play it.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p><em>Kirby’s Dream Land</em> could only happen on Game Boy. It’s a very short game featuring very little in the way of difficultly. Because of that it’s the first game I ever finished.</p>\n\n<p>When I was a kid, I owned two platformers at opposite ends of the Game Boy spectrum: <em>Donkey Kong Land</em> and <em>Kirby’s Dream Land</em>. <a href=\"/articles/dmg-yt.html\">I have already talked about <em>Donkey Kong Land</em></a> and its atrocious choices. It’s a terrible game for the limited Game Boy screen that ignores the shortcomings of the screen. <em>Kirby’s Dream Land</em>, released three years earlier, is in contrast a wonderful game for the unique screen of the Game Boy. It respects the limits of the portable system’s little green screen and creates a memorable game that sets the stage for a new mascot still popular to this day. If HAL Laboratory had not respected the limits imposed on them by the Game Boy we wouldn’t be talking about Kirby anymore, and Sakurai probably would not have become Nintendo’s biggest star developer of the 2010s.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-ky/dmg-ky-12.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /><figcaption class=\"figure_figcaption\">The game even has a proper ending that rewards your efforts. Kirby turns into a hot air balloon!</figcaption></figure>\n\n<p>Oh, I totally forgot! I was supposed to get back to the mystery of the many Kirbys! When you finish the game, during the ending cinematic, Kirby can be seen dropping on a stage with a crowd barely visible at the bottom of the screen. They’re all perfectly round shapes, only seen in shadows, which leads me to believe that Kirby was envisioned as the member of a whole species of Kirbys. They seemed to have abandoned that idea.</p>\n"},{"id":"dmg-amoe","date_published":"2022-08-11T00:00:00-05:00","url":"https://gameboyessentials.com/articles/dmg-amoe","title":"Mole Mania","image":"/assets/dmg-amoe/dmg-amoe-start.png","banner-image":"/assets/dmg-amoe/dmg-amoe-start-social-share-card.png","content_html":"<h1 id=\"mole-mania\">Mole Mania</h1>\n\n<ul>\n  <li>Japanese release in July 1996</li>\n  <li>North American release in February 1997</li>\n  <li>European release in 1997</li>\n  <li>Published by Nintendo</li>\n  <li>Developed by Nintendo EAD &amp; Pax Softnica</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/dmg-amoe/dmg-amoe-1.jpg\" width=\"640\" height=\"639\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">It’s a mole with glasses!</figcaption></figure>\n\n<h2 id=\"buried-treasure\">Buried Treasure</h2>\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/dmg-amoe/dmg-amoe-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>Gunpei Yokoi, the father of the Game Boy, was in a weird spot. He was the company’s oldest team leader at Nintendo but his reputation was shot. Inside the company he was seen as having lost his way, having spent too much of the company’s time and effort on a failed project with no appeal, the dreadful Virtual Boy. It was the epitome of his creed of using old technology in surprising ways (usually translated as <em>Lateral Thinking with Withered Technology</em>) but it lacked the fun factor that made Nintendo into a household name resulting in a very public failure for the company. Yokoi had planned on leaving Nintendo right after the release of the Virtual Boy. His interest in seeing the new console to release was the only thing keeping him at Nintendo. With that project a burning red failure, Yokoi stayed; he wanted to leave on a positive note, not in disgrace. To that end, he looked at the original Game Boy. It ran laps around the competition of portable consoles but all the media outlets were wondering why there was no new hardware. The answer was pure Nintendo: they were intent on maintaining the same principle that made the Game Boy a success of not compromising on battery life. Since there was no new CPU or screen tech that would provide a better experience while maintaining a reasonable battery life, Gunpei Yokoi tasked himself and his team with making a better version of the already existing Game Boy. This project would ultimately lead to the Game Boy Pocket.</p>\n\n<p>While Nintendo kept the same muted, simple strategy for its portable behemoth, Game Boy games were getting rarer. To keep shelves stocked with good games Nintendo started their Players’ Choice program. <a href=\"/articles/dmg-zl/\"><em>The Legend of Zelda: Link’s Awakening</em></a>, <em>Star Wars</em>, <a href=\"/articles/dmg-bb/\"><em>The Bugs Bunny Crazy Castle</em></a>, <a href=\"/articles/dmg-rw/\"><em>Mega Man: Dr. Wily’s Revenge</em></a> are just some examples of games republished by Nintendo under their Players’ Choice banner. Clearly, the company was trying to put older titles of better quality on store shelves to maintain interest for the Game Boy and its new upgrade the Game Boy Pocket.</p>\n\n<p>While in Japan <em>Pokémon</em> was out since February of ’96, the global future was uncertain. It was a truly gangbuster success locally that had given a second wind to the Game Boy but could this success be replicated outside Japan? Could Game Freak, an unproven group of young inexperienced people, provide more Pokémon games to solidify the mania? How long would people buy Game Boy systems to play <em>Pokémon</em>? Nothing was certain. Out of this weird middle age for the Game Boy, Game Boy Pocket was born. With that new console revision came one marquee title to coincide with the release, the fourth and final Nintendo EAD developed game for Game Boy: <em>Mole Mania</em>. A puzzle game pitting you as a mole that pushes and throws things while digging holes, the best way to describe it would be to compare it to the action puzzle games of the ’80s like <em>Sokoban</em> or <em>Lode Runner</em>.</p>\n\n<p>I cannot say it loud enough: play this game! <em>Mole Mania</em> is very good. It’s a Shigeru Miyamoto masterpiece done during his golden age when his output was arguably at his summit. He was supervising classics like <em>Yoshi’s Island</em> and <em>Super Mario 64</em> and here comes this game done in a genre that he had abandoned, and he brings all the lessons he learned since he last made an action puzzle game. It’s a true bona fide classic, and it’s absolutely <strong>forgotten</strong>.</p>\n\n<h2 id=\"a-hole-game\">A Hole Game</h2>\n<p>Since this is a top-of-the-line Miyamoto game all the bad things about action puzzle games are smoothed out. There are so many pitfalls the game could have fallen into but you can see they play-tested the hell out of the game to make it fun. Unlike <em>Lode Runner</em>, the enemies of the game stick to predictable patterns. They never run toward you, Terminator-style, making you run for your life every instant. Instead, <strong>you</strong> get in <strong>their</strong> way, because they follow a pattern.</p>\n\n<p>There’s always a short way to reset a puzzle. Like <em>Sokoban</em> you can get objects stuck but there’s a very simple way to reset a puzzle. You just leave the screen and come back. A menu option also exists.</p>\n\n<p>Every puzzle has the same solution: push the black ball against the rock blocking the path to the next screen. So you can fixate on getting that ball where it needs to go. There are multiple objects you can push but they always gravitate around getting out of the black ball’s way. However, the game often gives you more objects than you need. A pipe elbow will be pointless and irrelevant to the solution of the puzzle. Thus, puzzles are not always <em>clean</em>, meaning that you have more than what you need to finish it. On top of that, there are sometimes multiple methods to clear an exit. This is particularly apparent in level 4, where you have in quick succession multiple types of puzzles. So when reaching a new screen you immediately need to figure out whether there are objects that are useless to complete the level.</p>\n\n<p>The game’s core gameplay is a throwback to games like <em>Devil’s World</em> and other early Famicom titles. Like those games it’s a single-screen affair, very interested in providing time-sensitive puzzles and filled with unbeatable enemies that need to be avoided. It’s a game that reflects back on the era when everybody was improving on the <em>Pac-Man</em> formula. <em>Mole Mania</em> should have happened in the ’80s when you look at its lineage and genre but everything else about the game is very 1996. The presentation is flawless, the game is littered with valuable secrets. It has boss battles and bonus stages and the ability to be played somewhat non-sequentially so you can come back later to a puzzle that stumps you. All elements that were common by 1996.</p>\n\n<p>It feels like Miyamoto was thinking of an interesting project to do and saying <em>I know how to do this effortlessly</em> and <strong>he actually does</strong>. The presentation is as good as any mid 90s era SNES or N64 game with its distinct worlds, story told through the environment, and anime-inspired premise. <em>Mole Mania</em> is what happens when a developer goes back to older concepts and looks at those old tropes with their improved experience. Miyamoto knew how to push the contractors at Pax Softnica, with which he had already released two other Game Boy games, to refine the concepts until they were flawless, he knew how to remove anything superfluous so the game was easy to understand, and he knew how to build on his simple idea until it became delightfully hard while keeping its original core concept. Miyamoto in 1984, when he originally made games that look like <em>Mole Mania</em> was not <strong>that</strong> good. It might be my bias but I think <em>Mole Mania</em> is Miyamoto at his best. It was made in the same era as <em>Super Mario 64</em>, Nintendo EAD’s masterpiece. I can imagine a stressed out Miyamoto coming out of a difficult <em>Super Mario 64</em> design meeting and going to speak to the people making <em>Mole Mania</em> afterwards to relax with something relatively simple. Something where he already knew how to solve the problems, where he wasn’t confronted with 3D problems he had no idea existed and still had to figure out. Imagine how much easier it is to work on <em>Mole Mania</em> when you spent the whole day trying to figure out how to control the camera in <em>Super Mario 64</em>.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>The original Game Boy is at its best with this game; to me <em>Mole Mania</em> is a gift. I’ve adored Miyamoto’s trifecta of the late ’90s: <em>Yoshi’s Island</em>, which he believed to be his last 2D platformer, <em>Super Mario 64</em>, his success at inventing how to jump and explore a 3D world, and <em>The Legend of Zelda: Ocarina of Time</em>, the refinement of everything learned making those two other games. I thought I had played all his games made during that era, but here we have a fourth albeit lesser work done with the same talent by the same man and I had never played it. I can’t bring myself to finish <em>Mole Mania</em>; when I’m done I won’t have any games from golden age Miyamoto.</p>\n\n<p>As a last aside, <em>Mole Mania</em> gives a great example against the concept of console generations to classify video games. Go read about video game history on Wikipedia for example or pick up any lesser book and you’ll be very quickly presented with this idea of console generations defining the whole industry. It’s everywhere, to the point where developers themselves constantly discuss their work in the context of generations. While generations can make some sense if only TV consoles existed, portable systems exist and are just as important. A game like <em>Mole Mania</em> and any Game Boy game released in 1996 is considered in the same goddamn generation as the Famicom released in 1983. <em>Mole Mania</em> was developed by Miyamoto concurrently with <em>Super Mario 64</em>. Both titles are brethrens, directed by the same man at the same time. No one should consider those games two generations apart. So that’s why I’m against the concept of generations, which is player-centric, while video games are made by artists. Artistic considerations and mindsets are more important than marketing categorization. <em>Mole Mania</em> embodies that idea perfectly.</p>\n"},{"id":"dmg-apee","date_published":"2022-03-28T00:00:00-05:00","url":"https://gameboyessentials.com/articles/dmg-apee","title":"Pokémon: Red, Green, & Blue","image":"/assets/dmg-apee/dmg-apee-start.png","banner-image":"/assets/dmg-apee/dmg-apee-start-social-share-card.png","content_html":"<h1 id=\"pokémon-red-green--blue\">Pokémon: Red, Green, &amp; Blue</h1>\n\n<ul>\n  <li>Japanese release in February 1996 of Red &amp; Green and October 1996 of Blue (exclusive to CoroCoro Comic)</li>\n  <li>North American release in September 1998 based on Japanese Blue</li>\n  <li>European release in October 1999</li>\n  <li>Published by Nintendo</li>\n  <li>Developed by Game Freak</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/dmg-apee/dmg-apee-1.jpg\" width=\"640\" height=\"800\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">Green Version?</figcaption></figure>\n\n<h2 id=\"a-game-boy-resurrection\">A Game Boy Resurrection</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/dmg-apee/dmg-apee-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>Before it became a perennial staple of popular culture with its card games and anime series and yearly releases, <em>Pokémon</em> was a world filled with mysteries. Friends would trade Pokémon monsters using the Link Cable but they would also trade legends, tall tales of dubious veracity, secret incantations of duplications, and methods to find strange and forbidden monsters.</p>\n\n<p>That’s why, dear reader, I invite you to follow me starting on Route 1 throughout Kanto as I unveil the answer to the following mysteries:</p>\n\n<ul>\n  <li>What Secret Game Probably Inspired Pokémon’s Creator?</li>\n  <li>What Did Game Freak Publish Before Making Video Games?</li>\n  <li>Which Surprising Pokémon Was Born First?</li>\n  <li>What Horrible NES Game Funded the Development of Pokémon?</li>\n  <li>Who Really Owns the Pokémon Franchise?</li>\n  <li>Why Does the Game Have a Green Version in Japan?</li>\n  <li>Why Did It Take Two Years for the Game to Be Localized and Released in North America?</li>\n  <li>How Did Pokémon Teach Me About the Idiosyncratic Québec Media Landscape?</li>\n  <li>Are There More Than 150 Pokémon?</li>\n  <li>Is the Game Any Good?</li>\n</ul>\n\n<p>Well, maybe that mystery about the amount of Pokémon is a bit dated, considering there are now [he looks at Bulbapedia] 901 Pokémon, and that’s without counting all those variants and gigantic versions of all the old ones. I even heard there are some Pokémon amongst the newer ones that aren’t well designed! Gasp!</p>\n\n<p>Let’s forget all about those newer creations and go back to a time when everybody was wondering if there would ever be another game and Pikablu had not yet captured our imaginations.</p>\n\n<h2 id=\"what-secret-game-probably-inspired-pokémons-creator\">What Secret Game Probably Inspired Pokémon’s Creator?</h2>\n<figure class=\"figure figure_art float right\"><img class=\"figure_img\" src=\"/assets/dmg-apee/dmg-apee-3.png\" width=\"1000\" height=\"1272\" alt=\"Picture\" /></figure>\n<p>First let’s go back to 1989 to reveal the answer to our first mystery. Tajiri Satoshi, <em>Pokémon</em>’s creator, had a very fruitful first encounter with the Game Boy. While people were immediately drawn to the screen of the portable device Tajiri was inspired by a humbler element of the console; its Link Cable. He imagined little insects travelling along the wire, going from one Game Boy to the other. From this simple idea <em>Pokémon</em> was born. At least that’s the myth, told time and time again by Satoshi to explain the genesis of his concept.</p>\n\n<p>I’m a bit skeptical of this perfect story absent of any influence from other video games. He knew video games well and I refuse to believe Satoshi wasn’t influenced by <em>Makai Toushi SaGa</em>. Known in the West as <em>The Final Fantasy Legend</em>, it’s the first role-playing game for the system coming in a mere six months after the system’s initial release. It showed that the Game Boy was a perfect system for RPGs. I covered it previously, and I marvelled at how it attempted so much, so early in the system’s life. The game features monsters in your party, that can evolve (and devolve) based on eating the meat of your defeated enemies. I’m inclined to believe that Satoshi played <em>Makai Toushi SaGa</em> and got some inspiration from the game. Perhaps he even dreamed not of insects travelling along the wire but of the monsters in <em>Makai Toushi SaGa</em>.</p>\n\n<p>I don’t want to diminish the accomplishments, especially since the monster trading is a novel idea worth all the praise it has gotten, but there is this tendency with developers, and Japanese developers in particular to shy away from mentioning inspirations from other video games. All we can do is presume which is what I’m doing here.</p>\n\n<h2 id=\"what-did-game-freak-publish-before-making-video-games\">What Did Game Freak Publish Before Making Video Games?</h2>\n\n<p>Satoshi was a publisher of a fanzine focusing on arcade titles which he worked on alongside Sugimori Ken, the artist drawing the fanzine’s art. Ken would later become the main artist for the game.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/dmg-apee/dmg-apee-4.jpg\" width=\"768\" height=\"1024\" alt=\"Picture\" /></figure>\n\n<p>I saw some original copies of their fanzine in a museum exhibit and they were underwhelming. There’s no magical quality to them; they were low quality Japanese fanzines made with a lot of love but still simply fanzines. Those little staples books are relevant because they birthed Game Freak and put Satoshi and Ken together allowing them to later pivot to video game development.</p>\n\n<h2 id=\"which-surprising-pokémon-was-born-first\">Which Surprising Pokémon Was Born First?</h2>\n\n<p><a href=\"https://bulbapedia.bulbagarden.net/wiki/Capsule_Monsters\">The original concept for Capsule Monsters</a>, which would become <em>Pocket Monsters</em> before release, used generic creatures that looked like dragons and dinosaurs. Amongst those dinosaur-looking creatures, one has been identified as the first Pokémon, the first creature that was imagined during this early concept and survived all the way to the release of the game.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/dmg-apee/dmg-apee-5.jpg\" width=\"1000\" height=\"1113\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">Hey look who’s in the back of this very early sketch.</figcaption></figure>\n\n<p>Rhydon was the oldest design to end up in the final game. He is a very generic-looking dinosaur with a rhinoceros horn, so it makes a ton of sense that he is the oldest Pokémon, coming from the era where all the creatures were inspired by dinosaurs. More creative concepts like Electabuzz would come later.</p>\n\n<h2 id=\"what-horrible-nes-game-funded-the-development-of-pokémon\">What Horrible NES Game Funded the Development of Pokémon?</h2>\n\n<p>Once again I have to make a personal connection before I answer the question because I’m a raging narcissist. When the Super Nintendo came out, I didn’t have one. I had gotten a second-hand NES earlier in the year so of course my mother was not about to start upgrading her six-year-old son with the latest and greatest. Since I was smitten with Yoshi and dreamed of nothing but riding him in <em>Super Mario World</em>, I asked my mom to buy me <em>Yoshi</em> for NES as a birthday gift. When I started playing it this is what I saw.</p>\n\n<figure class=\"figure figure_pixel\"><img class=\"figure_img\" src=\"/assets/dmg-apee/dmg-apee-6.png\" width=\"292\" height=\"240\" alt=\"Screenshot\" /><figcaption class=\"figure_figcaption\">What a giant piece of shit.</figcaption></figure>\n\n<p>It’s a shitty puzzle game. To rub even more salt in the wound, there’s a better Yoshi puzzle game, <em>Yoshi’s Cookie</em>, and <em>Yoshi</em> is not even half as good as <em>Yoshi’s Cookie</em>. It’s just terribly uninspired and boring.</p>\n\n<p>So what’s the Pokémon connection? Game Freak was cash poor during the early ’90s, and Nintendo bailed them out because they believed in their Pocket Monsters concept. I think part of the help they got from Nintendo was to be assigned to develop <em>Yoshi</em>. This allowed them to make enough money on a surefire hit based on a hot new character,\n and to learn the complicated details of video game development. They could keep going and maintain the development of <em>Pokémon</em> using the money they made from <em>Yoshi</em>.</p>\n\n<p>Now I can sleep at night knowing that I directly financed the development of Pokémon all the way back in 1992. Well, I guess my mom financed the development of <em>Pokémon</em>. Be sure to thank my mom if you see her.</p>\n\n<h2 id=\"who-really-owns-the-pokémon-franchise\">Who Really Owns the Pokémon Franchise?</h2>\n\n<p>When <em>Pokémon Go</em> was initially released on iOS and became <strong>the</strong> global phenomenon of the summer of 2016, Nintendo’s stock in the Tokyo stock Exchange suddenly doubled. Nintendo, unfortunately, could not enjoy this sudden excitement for their stock. Because they knew that investors would cool when they learned that Nintendo is not the master of the Pokémon franchise. <a href=\"https://time.com/4421450/pokemon-go-nintendo-shares-tokyo/\">They clarified their complicated relationship with Pokémon Go, and the stock went back down</a>. It’s obvious they were scared the stock would fall <strong>harder</strong> once the game was monetized and Nintendo would make no money from the game. You see, Nintendo didn’t make <em>Pokémon Go</em>, and they don’t even wholly own the Pokémon franchise. In fact, they do not receive direct revenue from <em>Pokémon</em>. What? Nintendo doesn’t outright own Pokémon? Then who does? Three companies do, with a fourth special case, and let’s go through each one.</p>\n\n<h3 id=\"game-freak\">Game Freak</h3>\n\n<p>The OG gang, the company created by Tajiri Satoshi, Masuda Jun’ichi, and Sugimori Ken to publish their fanzine that later transitioned to video game development. It is at this company that Tajiri created the whole Pokémon concept and it is still to this day the birthplace of any new concept or monster. No other developer or licensee can willy-nilly create a new Pokémon called Pikatwo; Game Freak is the sole place where new Pokémon are birthed. They have stayed a small developer, even though they’re the idea factory of the largest media franchise in the world. The small size is seemingly to foster creativity and maintain a high level of control. Whenever anybody complains that the graphics in a Pokémon game are terrible, their minuscule size is the reason. They simply do not have the manpower to rival the bigger studios inside Nintendo.</p>\n\n<p>Like I just mentioned, they’re the company responsible for the development of Pokémon games but only what is usually called the core games; think <em>Pokémon Sun</em> or <em>Pokémon Legends: Arceus</em>. Altough that distinction is getting muddled, with the latest remakes, <em>Brilliant Diamond</em> and <em>Shining Pearl</em> being developed by ILCA, a relatively obscure Japanese developer. Quick aside, they obviously delegated those two remakes to ILCA to work as much as possible on <em>Pokémon Legends: Arceus</em>, a top to bottom reinvention of the game concept. With once again terrible graphics.</p>\n\n<h3 id=\"nintendo\">Nintendo</h3>\n\n<p>Between the birth of the idea from the mind of Tajiri Satoshi and the release of the first game in 1996, Game Freak presented the project to Nintendo and the company became its publisher. Nintendo also acquired a stake in the franchise itself. This is particular since a publisher does not necessarily own the intellectual property of the game it publishes: you can look at <em>Banjo-Kazooie</em> for example, initially published by Nintendo in the ’90s but now available on Microsoft consoles. This could happen because the company that made the game, Rare, did not sell the ownership of the copyright to Nintendo even though Nintendo owned a controlling stake in Rare; they instead collaborated on the development and distribution. If I had to hazard a guess as to why Nintendo bought a stake in the Pokémon franchise itself I’d say it’s because Game Freak needed the money to finish the game.</p>\n\n<p>In direct terms, Nintendo shares the Pokémon copyright with the other three companies holding it. It shares the trademark in Japan with those three companies and is the sole owner of the trademark in the rest of the world. Don’t forget to look up the difference between a copyright and a trademark kids. This share of the franchise means Nintendo considers <em>Pokémon</em> its own: Pikachu and the rest were in <em>Super Smash Bros.</em> from the first game’s release.</p>\n\n<p>To most people everything related to Pokémon is made by Nintendo when the truth is far more complicated. Nintendo’s not even the sole publisher of the Pokémon games on Nintendo’s own consoles. They share that role with the Pokémon Company that they also happen to co-own with the other companies with which it shares the Pokémon copyright. I told you it was complicated.</p>\n\n<h3 id=\"creatures-inc\">Creatures Inc.</h3>\n\n<p>Who is Creatures Inc. exactly? It makes sense that Game Freak and Nintendo share the franchise, but why is there a third company in the mix? According to Masuda Junichi, a co-founder of Game Freak and the current creative overseer for the games, they were the producers of the first game. This is strange since the producer of a game is usually a person working for the company making the game, not an outside company. Thinking about the situation, I don’t think they’ll ever admit it, but I think Creatures Inc. was brought in to help Tajiri finish the game. He couldn’t do it alone since he had never produced a game before: he was a fanzine writer.</p>\n\n<p>The history of Creatures Inc. also seems to confirm my thinking. Creatures Inc. is made-up of former employees of Ape Inc. who supported a visionary artist with no video game experience to produce a very personal RPG based on a fairy-tale version of our modern world. I’m of course not talking of <em>Pokémon</em> but of Itoi Shigesato and his game <em>Mother</em>, which we know in the West as <em>Earthbound Beginnings</em>. It turns out the employees of Creatures Inc. helped with the same job twice!</p>\n\n<p>Since they helped finish the first Pokémon game their contract clearly gave them partial ownership of the franchise, and they went on to create the Pokémon trading card game (it wasn’t made by Wizards of the Coast who simply localized it) and other elements of the franchise. Once again if I had to guess as to why Creatures own a part of the franchise it’s because Game Freak couldn’t pay them to help them, so they paid them with a franchise stake.</p>\n\n<h3 id=\"the-pokémon-company\">The Pokémon Company</h3>\n\n<p>Created by all three above companies to initially manage the <em>Pokémon Center</em> stores popping up in Japan in the early ’90s, it quickly became the company managing the licensing of Pokémon. So if a toiletry company wants to put Pikachu on a towel, they call The Pokémon Company, not Nintendo. The question arises, though: why not let Nintendo manage the licensing?</p>\n\n<p>These days, Nintendo is good at licensing its characters for interesting products. I’m particularly impressed by the Mario Lego sets, with its special Mario Lego character with screens for eyes, a small speaker and an NFC reader allowing him to emote and react to specially tagged bricks. Or <em>Mario Kart Live</em>, the toy that allows you to kart race in your own home. In the mid ’90s, however, Nintendo was only able to give adequate focus to the Japanese market. Licensed Nintendo products overseas like toys, cereals, books, or content like TV shows and movies were all terrible. <a href=\"https://gamehistory.org/watch-nintendo-power-reunion/\">In a recent reunion organized by the VGHF, Gail Tilden, first editor-in-chief of Nintendo Power Magazine</a> mentioned that licensing at Nintendo throughout the ’90s was barebones and that the magazine had to produce its own marketing material.</p>\n\n<p>So I don’t believe Nintendo was prepared to deal with Pokémon: they never managed to license anything worthwhile related to <em>The Legend of Zelda</em>, for example. They were a toy maker, not a licensing manager. So a fourth company was emboldened to manage everything related to licensed Pokémon products.</p>\n\n<p>The Pokémon Company now even co-publishes the games on Nintendo consoles and has become the sort of brand manager for Pokémon in its entirety, managing tournaments, products, and announcements related to the franchise. So they have never stopped growing their importance as time went on. If one company is responsible for the successes and mistakes made with the franchise now, it’s them.</p>\n\n<h2 id=\"why-does-the-game-have-a-green-version-in-japan\">Why Does the Game Have a Green Version in Japan?</h2>\n\n<p>Upon its initial release in Japan the two versions of the game were the red and green versions. Most people are aware of this regional difference in versions since the remakes on Game Boy Advance feature those original colours but I still feel compelled to explain it.</p>\n\n<p>One fascinating invention of Pokémon is the concept of the dual versions. To foster the trading of monsters between players, the game came in two flavours, green and red, with a specific subset of Pokémon unique to each game. This meant that to complete your Pokédex (that you owned one copy of every creature) you have to trade with someone else. Someone with a different version. There isn’t an overwhelming list of Pokémon unique to each version, just a handful, but it taught everyone that Pokémon is about trading with other players.</p>\n\n<p>As the Japanese in early 1996 were going crazy over those two initial versions, <em>Pocket Monsters: Red</em> and <em>Pocket Monsters: Green</em>, players also discovered the game had some rough edges. The graphics were clunky, the monsters didn’t look exactly the same as in the manual illustrations, and the game had some unfortunate bugs. A version that featured updated graphics and fixed some of the bugs was released later in 1996. This was called <em>Pocket Monsters: Blue</em>. All the later localization work was based on this improved game so no one outside Japan ever saw the original graphics. They kept the original monster distribution from Japanese Red for international Red, and transposed the Green distribution into the international Blue version. At this point, why not go all the way and localize Green instead? I guess Blastoise has cannons, that’s too cool to pass up.</p>\n\n<p>We’ll talk about Yellow in its own article.</p>\n\n<h2 id=\"why-did-it-take-two-years-for-the-game-to-be-localized-and-released-in-north-america\">Why Did It Take Two Years for the Game to Be Localized and Released in North America?</h2>\n\n<p>This one is easy to answer: <em>Dragon Quest</em>. Back in the days of the Famicom, <em>Dragon Quest</em> seduced the Japanese with its quirky reinvention of the role-playing game. By <em>Dragon Quest III</em>, the series was a societal phenomenon. Enix famously moved releases to Saturdays, to alleviate public concerns from some Diet legislators.</p>\n\n<p><em>Pocket Monsters</em> was obviously going in the same direction in Japan. Everybody and their mother knew about the game and anything related to the franchise was a guaranteed smash hit. But there was one major flaw with <em>Dragon Quest</em>: no one cared about it outside of Japan. It had its fans but Nintendo was directly stung by its poor North American reception. They published the localization in North America and had such a sale dud that they had to give the cartridges with Nintendo Power subscriptions to get rid of their unsold copies.</p>\n\n<p>This failure led to years of statements by employees of Nintendo that non-Japanese players didn’t like RPGs. They weren’t wrong; RPGs sold far less in North America than in Japan, but it was a chicken or the egg situation. RPGs had a ton of text to localize, which meant a protracted localization process, and used far more memory, which all meant a more expensive product. For these reasons few Japanese RPGs were localized and brought West meaning it was much harder to build an audience for the few games that did see a release. When Nintendo tried their hands at bringing RPGs to North America they always had disappointing results. <em>Earthbound</em> left a particularly sour taste to everyone involved at Nintendo of America <a href=\"https://gamehistory.org/ep-74-pokemons-translator-nob-ogasawara/\">according to <em>Pokémon</em> translator Nob Ogasawara</a>. It was very difficult to translate with <em>Mother</em> creator Itoi Shigesato getting directly involved and sold very poorly, killing any hope to reverse the trend of underperforming RPGs with <em>Earthbound</em>.</p>\n\n<p>This illustrates how careful everyone at Nintendo was regarding <em>Pocket Monsters</em>. It was yet another reinvention of the role-playing game and the same lack of interest for the genre could hurt them once again, just like <em>Dragon Quest</em> and <em>Mother</em>/<em>Earthbound</em>.</p>\n\n<p>They had to try releasing it outside Japan, it would be ridiculous not to, but they wanted to take their time to get it right. They considered redesigning the creatures to increase their <em>western</em> appeal but ultimately abandoned the idea. Time was ticking and on top of that the industry had started to change since the release of <em>Dragon Warrior</em>. We were now under the auspices of an entertainment model. In effect, the marketing challenge for game publishers had shifted. Before, you had to get a consumer to buy your game. Now, you had to get a retailer to stock your game in the first place.</p>\n\n<blockquote>\n  <p>Starting around 1994, the software industry transitioned to what Nina Schulyer called the <em>entertainment model</em> of marketing. If retail shelf space was harder to come by and lasted for a shorter time, the idea was to put more resources into generating hype in advance, raising awareness for the title before it was even released, the same way Hollywood studios promoted movies. […] It’s no coincidence that right around this time also marked the beginning of Electronic Entertainment Expo (E3), a massive game industry marketing event that was originally intended as a way to advertise directly to retailers.</p>\n\n  <p><a href=\"https://obscuritory.com/essay/incredible-boxes-of-hock-wah-yeo/\">Excerpt of <em>The incredible boxes of Hock Wah Yeo</em> from The Obscuritory</a>.</p>\n</blockquote>\n\n<p>Nintendo could not put a game on the shelves and spend months hyping it like they did in 1989 with <em>Dragon Warrior</em>; retailers did not have the patience for that. Considering the original <em>Pocket Monsters</em> in Japan became a phenomenon through word of mouth and needed months to reach its sale potential, it benefitted greatly from the old model where the game sat on shelves waiting for consumers.</p>\n\n<p>So Nintendo, Game Freak and Creatures wisely prepared something special for the release of Pokémon. Nintendo internally translated most of the core concepts of the game and would then use those translated Pokémon names and concepts for the anime localization. Those two products, game and anime, would both release together in the fall of 1998. A one-two punch of Pokémon content, which would hopefully entice american children. For good measure, the surprisingly successful Trading Card Game would follow the next spring, distributed by Wizards of the Coast, the people behind <em>Magic: The Gathering</em>.</p>\n\n<p>It took them a while to arrive at this plan, and required a lot of effort to implement. History vindicated their patience.</p>\n\n<h2 id=\"how-did-pokémon-teach-me-about-the-idiosyncratic-québec-media-landscape\">How Did Pokémon Teach Me About the Idiosyncratic Québec Media Landscape?</h2>\n\n<p>I was 10 in 1996 when <em>Pocket Monsters</em> was released in Japan. I was still playing with my Game Boy even though it felt like the rest of the world had moved on. Games were still available but the recent releases left me unimpressed. I focused my attention on playing older releases whenever I could.</p>\n\n<p>But I started hearing a rumour, from magazines and video game TV shows, about this new Game Boy title made by Nintendo (no one ever mentioned Game Freak back then). A game were you explored a world full of monsters. You captured and befriended those monsters to fight other trainers, never fighting them yourself.</p>\n\n<p>I obviously knew that Nintendo and all my favourite video games were made in Japan but here was rare news about an exciting <strong>Game Boy</strong> title. The really crazy part, though, was that the game was a massive cultural phenomenon in Japan. The news and articles were saying that everyone was playing it. What? Everybody was playing a Game Boy game in 1996? It was unbelievable to my young brain. I thought I was the only person still playing the Game Boy.</p>\n\n<p>You have to do a bit of mental work here, dear reader, to forget the existence of Pokémon. It’s not an easy thing to do. Pokémon is according to most metrics the most profitable media franchise <strong>ever</strong>.</p>\n\n<p>You think the Marvel Cinematic Universe is bigger? Nope. They don’t have much reach outside the movies and TV shows themselves so it’s not enough revenue to compete.</p>\n\n<p>Star Wars, with its forty years of associated toy sales? It’s not enough of a success outside North America, particularly in Asia, to compete. Star Wars is perhaps bigger than Pokémon in the US, but not worldwide.</p>\n\n<p>Star Trek? The Pokémon trading card game alone is bigger than all of Star Trek at an estimated ten billion dollars in card revenue since its release.</p>\n\n<p>Pokémon is simply the biggest media franchise ever, and it’s as relevant now all around the globe in 2022 as it has ever been. But there was a time before Pokémon was a global phenomenon. For a time, it was strictly a Japanese affair. The rest of the world could only stay outside, trying to look inside. And we’re not talking months here. Pokémon remained a Japanese phenomenon for two years. The rest of the world could only get an outside glimpse at the craze for a very long time. The trading card game, a Nintendo 64 game that allowed you to fight using the Pokémon from your Game Boy cartridge, a manga, the anime, even the first movie were all released before the Poké-phenomenom left Japan.</p>\n\n<p><em>Pokémon</em> was finally released in North America in the Fall of 1998, and it promptly flew over my head. I didn’t notice it was released. I was unaware that the Japanese phenomenon had finally crossed the Pacific. I didn’t even know they had decided on <em>Pokémon</em> as its English name. How could that be? <em>Pokémon</em> was released in North America along with the anime. It was everywhere. How could I completely miss this release? Before I answer that question, let’s move forward in time to early 1999, when I saw the best video game publicity ever made.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/dmg-apee/dmg-apee-7.png\" width=\"640\" height=\"480\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">Strictly based on this ad’s sense of humour, I decided to buy the game.</figcaption></figure>\n\n<p><em>Super Smash Bros.</em> came out in April of 1999 and I bought it as soon as possible with my hard-earned paperboy money. <em>Super Smash Bros.</em> obviously features Pikachu, and even Jigglypuff, as playable characters. There’s a stage from the franchise as well, and you can even use Pokéballs. I immediately got very curious once I started playing. There’s a yellow electric rat constantly screaming his own name that’s given as much reverence as gaming Jesus, our lord and stomper, Mario. What was the deal with that? So I remembered all those rumblings about the pocket monster game, and figured that the game must be this Pokémon thing I was seeing in <em>Smash</em>. When I looked at the Works section in Pikachu’s character sheet, his single released game was there.</p>\n\n<figure class=\"figure figure_pixel\"><img class=\"figure_img\" src=\"/assets/dmg-apee/dmg-apee-8.png\" width=\"645\" height=\"480\" alt=\"Screenshot\" /><figcaption class=\"figure_figcaption\">That’s how old I am kids. I learned that Pokémon was released from the <em>Super Smash Bros.</em> character biographies.</figcaption></figure>\n\n<p>I finally ended up seeing both the <em>Red</em> and <em>Blue</em> games at my local Zellers. How could I miss the media onslaught of <em>Pokémon</em> and being surprised at the presence of Pikachu in <em>Super Smash Bros.</em> ?</p>\n\n<p>Because I’m Québécois. In Québec, the language barrier meant we got some stuff later than the United States and Canada. Big popular movies came out dubbed in French at basically the same time but books and especially TV shows were on a different timeframe as the rest of North America. An American TV show had to become popular enough to warrant shopping it around internationally, then it has to be licensed and dubbed by a Québec TV network and only then can it be put on their schedule.</p>\n\n<p>Don’t go thinking that Québec always uses dubs made in France. A lot of French dubs for movies and TV shows are meant to be used internationally; they’ll use language understandable across <em>la francophonie</em>, and use a toned down Parisian accent informally called international French. These dubs are common in Québec for movies and TV shows but not all dubbing follows these constraints. Comedic and lighthearted content, like a Japanese anime about a boy capturing local wildlife in red balls, is better served by a local dub since it can more accurately reflect the local inflection and sense of humour.</p>\n\n<p>Doing a cursory investigation tells me that Québec would usually get popular American TV shows a year later than in the US during the ’80s and ’90s, whether a French or Québec dub was used. That is if the show came to Québec at all. Some TV shows were never broadcast in Québec, and others, like American single-camera sitcoms were never popular in Québec. They’re cheap to make, so Québec produced its own sitcoms that were more popular than the American ones. Shows like <em>Friends</em> or <em>Seinfeld</em> were not particularly popular here in large part due to their use of a French from France dub.</p>\n\n<p>But the overwhelming majority of video games were not translated at the time (publishers were finally required by law to offer French versions of their games in 2007) and would come out at the same time in both markets. This led to interesting situations in Québec. For example, the Capcom game of <em>Chip ’n Dale: Rescue Rangers</em> for NES was available <strong>before</strong> the cartoon was broadcast on TV. This was absolutely normal for me and all my friends back then.</p>\n\n<p>As a final aside, the situation has changed considerably in recent times; I vividly remember being astonished in 2006 that the show <em>Lost</em> was broadcast in French on Radio-Canada only six weeks after the original version had aired on ABC in the US. Nowadays, the lead time for dubbed versions has been reduced even further. The greatest example is <em>Game of Thrones</em>, which was available in 170 countries on the same day during its last few seasons. On the other hand, most broadcast (ie. non-streaming) media still has some lead time before the release of its dub in Québec and other international markets. Depending on the property the French dub might be used, without a proper local Québec dub.</p>\n\n<p>So why am I telling you all this? <a href=\"https://groups.google.com/g/fr.rec.anime/c/c2DdoMma9Z0\">Because the <em>Pokémon</em> anime arrived in Québec in the fall of 1999, one year after the game’s release in 1998</a>. I missed the media onslaught because there was no media onslaught. North America was not like Europe where companies would coordinate multiple localization when releasing there. North America back then meant a strictly English release, with local Québec broadcasters left to fend for themselves. In the case of Pokémon, the translators waited a year to use the scripts from France, but dubbed the anime with Québec voice artists, using the English Pokémon name but the localized town and location names used in France. I think this is in large part because the game was only available in English in Québec; we were already familiar with names like Jynx, so French names like Lippoutou were deemed innapropriate.</p>\n\n<p>This made Québec the only region in the world to use the English Pokémon name in another language. Nowadays Québec has lost its local dub; the dub from France is unfortunately used. This means that Québec is also the only region in the world where the names of the creatures suddenly changed! With the now common practice of releasing games across North America in English, Spanish, and French, Lippoutou is now <em>de rigueur</em>.</p>\n\n<h2 id=\"are-there-more-than-150-pokémon\">Are There More Than 150 Pokémon?</h2>\n\n<p>Of course there have been more than 150 Pokémon for a long time, but were there more than the 150 Pokémon upon the initial release? And maybe more importantly, why does it even matter? It matters because there was indeed a hidden Pokémon only accessible through special events or outright cheating. This created an aura of mystery around the game. Since the original Pokémon is also riddled with bugs, causing all sorts of glitches to occur, players started seeing all sort of weird things they falsely prescribed to intended secret monsters.</p>\n\n<p>That real hidden Pokémon was Mew, designed and hidden by Morimoto Shigeki the programmer of the game, as a kind of prank that only he could access and share with his colleagues. Mew was, of course, mentioned in the game (Mew<strong>two</strong> was in the game after all) but the creature was not meant to be seen. Once the rest of the team learned of the existence of Mew they started officially distributing the creature during events. This meant it was rare for Japanese players to receive a Mew and bred the interest in finding ways, fake or not, to catch Mew. Look up the legends surrounding the truck in Vermillion City. I remember having to hear all about that truck and feeling so bad for the people who wholeheartedly believed Mew was hidden under there.</p>\n\n<p>Mixing into this desire for the real hidden monster, the game was riddled with bugs and bogus glitches allowed one to capture creatures that were the result of memory corruption. The most famous of these was <em>MissingNo.</em> and I remember schoolmates showing me the glitch all the way back in 1999. That sure didn’t help people differantiate truth from fiction; if you could catch a glitched Pokémon by surfing alongside a border of the map, why couldn’t you catch a Mew under a truck?</p>\n\n<p>A year after the game’s release, idle theories and useful glitches, like the candy duplication trick, were already widely shared amongst players even in the depths of Lac-Saint-Jean.</p>\n\n<h2 id=\"is-the-game-any-good\">Is the Game Any Good?</h2>\n\n<p>You’ve always had to bring your own fun into a <em>Pokémon</em> title. No hand-holding can change the fact that the core games have always been about deciding on your own what’s fun for you. Do you want to create an unbeatable team? What about playing through the story with a team of six Jigglypuff? Maybe you’re interested in collecting every monster? Perhaps your interest lies in the thrill of competing against your friends? Or maybe trading with your friends? <em>Pokémon</em> really shines when you can define an objective for yourself. I have only experienced <em>Pokémon</em> as a solo endeavour, with the goal of completing the game, since no one cared about it when I picked it up to help me spice things up. So it was kind of boring for me. Once the <em>Pokémon</em> anime hit the Québec airwaves, and a group of kids at school started playing the game during lunch, I had moved on.</p>\n\n<p>If you pick it up in 2022, you’ll have a tough task ahead of you; you’ll have to figure out how to have fun with that game. It’s a difficult endeavour getting harder: I mean, <em>Pokémon Legends: Arceus</em> is right there, ready to entertain you effortlessly, albeit with terrible graphics.</p>\n\n<p><em>Pokémon Legends: Arceus</em> notwithstanding, every new adventure had been an improvement over the previous game, never a reinvention. So going back in time and playing the earlier titles is difficult. Perhaps if a feature you loved was removed there was reason to walk back the route. But nostalgia is the powerful drug that keeps people coming back to the first title. When they do, those people have to contend with so many irritants. For one, the game is excruciatingly slow. Everything takes forever. You walk slow, the menus are slow, the animations are slow, the text scrolls slowly, saving is slow. Nothing is fast, and the game feels fragile as a result. It feels like you can’t push the buttons on your Game Boy too hard or the game will break under the load. Considering the game is infamous for its buggy code it’s warranted. After all, they famously abandoned their old code base and rewrote everything when they released <em>Pokémon Ruby &amp; Sapphire</em> on Game Boy Advance.</p>\n\n<p>If you can get past the disrespect that game has for your time, which is a tough pill to swallow, you’ll find a quirky fun RPG with a wicked concept: no creature in the game is only an enemy. You can ultimately train and befriend your own Muk, or Lapras, or Zapdos. You can then use those monsters to trade and battle with your friends, using the connectivity afforded by the link cable. When it released, multiplayer experiences were far more niche than they are today. Online multiplayer, with services like Battle.net, were embryonic and riddled with issues and massively multiplayer online games were the purview of the committed few. The multiplayer concept was unique. No other game allowed you to trade creatures with your friends. Heck, even nowadays the concept is unique with nary a serious competitor to Game Freak in sight.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Only on Game Boy could Pokémon become such a large hit. The confluence of a large installed base with the ubiquity of the link cable made the gigantic hit a possibility. No other video game platform was as perfectly positioned to deliver the biggest media franchise in the world. That is what makes discussing everything around <em>Pokémon</em> interesting for me. I don’t believe for one second that <em>Pokémon</em> could have happened on Super Famicom or any other console. The core idea of trading monsters with friends would have needed a technological solution that Game Freak was incapable of developing since they were such a small studio. After seven years of Game Boy, <em>Pokémon</em> finally fulfilled the possibilities of the link cable. It was suddenly cool that portable consoles offered device-to-device multiplayer. Even today, the Switch is capable of playing a local game and trading monsters with another Switch next to it without any internet access needed. You can’t do that with two PlayStations or two Xboxes.</p>\n\n<p>Another important aspect was the incredibly long legs of the concept. You couldn’t shake the idea that sequels were inevitable while playing the first game. Exploring Kanto, you could imagine other regions with other completely different monsters just outside the realm of your Game Boy screen. It’s not a surprise that an anime, a trading card game and other video games were easily developed once Pokémon hit it big: its concept is versatile and can be adapted to almost anything. Case in point, they made a Pokémon detective movie.</p>\n\n<p>Finally, Pokémon made the Game Boy cool again, to everybody’s surprise. Game Boy hardware sales massively picked up once <em>Pokémon</em> was released. That meant that there was a renewed interest in the console. Around the world, old Game Boy development kits were cleaned of their cobwebs, and a massive amount of new titles started development. With the hindsight of years of experience with the platform, and the inspiration from <em>Pokémon</em> to innovate, the overall quality of those new games was surprising. The Game Boy went from also-ran to exciting within a year.</p>\n\n<p>It also happened to be the only console where you could make a <em>Pokémon</em> ripoff, since no other popular system could allow trades between cartridges. All of that gave the Game Boy a renaissance that no console ever had, or ever will. The Game Boy was reborn thanks to those little insects walking up and down the link cable.</p>\n"},{"id":"cgb-bd3e","date_published":"2021-07-05T00:00:00-05:00","url":"https://gameboyessentials.com/articles/cgb-bd3e","title":"Dragon Warrior III","image":"/assets/cgb-bd3e/cgb-bd3e-start.png","banner-image":"/assets/cgb-bd3e/cgb-bd3e-start-social-share-card.png","content_html":"<h1 id=\"dragon-warrioriii\">Dragon Warrior III</h1>\n\n<ul>\n  <li>Japanese release in December 2000</li>\n  <li>North American release in July 2001</li>\n  <li>Never released in Europe</li>\n  <li>Published by Enix</li>\n  <li>Developed by Enix &amp; TOSE</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/cgb-bd3e/cgb-bd3e-1.jpg\" width=\"821\" height=\"850\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">Pure adventure.</figcaption></figure>\n\n<p>The video game discussed here was created in part by composer Sugiyama Koichi, who has publicly and financially supported historical negationism of Japanese war atrocities for decades. His vile activism should never be forgotten.</p>\n\n<h2 id=\"the-classiest-of-the-classiest\">The Classiest of the Classiest</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/cgb-bd3e/cgb-bd3e-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>I love <em>Dragon Warrior III</em> (<em>Dragon Quest III</em> nowadays and in Japan upon its release). It’s a cozy pair of slippers for my soul. When I’m mentally exhausted at the end of the day, I simply sit down, put my legs up and enjoy playing this magnificent video game. I then relax by slowly unwrapping the game, step by step, battle by battle, dungeon by dungeon, town by town. It’s never too complicated or difficult, meaning I don’t have to concentrate too hard to progress and a fatal mistake only costs half your gold. Join me, why won’t you, on this essential quest to talk about my love for <em>Dragon Warrior 3</em> for Game Boy Color.</p>\n\n<h2 id=\"colours\">Colours?</h2>\n\n<p>I want to start by talking about colours. Yes, colours. I’ve heard from many people that the Game Boy Color’s palette is ugly, with its muted and dull colours. I don’t think they are particularly unpleasant but I do agree that on an original system, with its unlit display, the colours tend to wash out. Developers clearly dealt with this problem in their own way, giving lieu to a lot of games with strange choices. <em>Dragon Warrior III</em>’s colour choices make me feel all warm inside. I love the beautiful pairing of red and gold for the ubiquitous castle carpets. It has a very regal look that makes you feel comfortable. Whenever you stop to look at a single tile making up a wall or a roof, you can find small intricate details that would normally go unnoticed. It’s incredible the amount of effort that went into every corner of this game. Travelling through this chibi fantasy world is a wonderful experience. There’s always more to explore in every new town, a different corner of the map to unveil, an unseen enemy type to encounter. One reason the game is so beautiful is Toriyama Akira’s art style is perfect for a low resolution. Famously known as the creator of <em>Dragon Ball</em>, Toriyama Akira has always been the dedicated character and creatures designer of the series. Whenever you compare his initial enemy drawings with the final result adapted for the pixellated screen of old systems, the number of retained details is impressive.</p>\n\n<p>After the art is redrawn with such graphical constraints, you get to appreciate what makes his art style thrive here. His use of big eyes and in general large facial features while keeping a low line count is what impresses me the most. He obviously knew he was working within specific constraints and drew unique creatures that would work well with small sprites and limited colour choices. Look at his drawing of the golem, made for the first <em>Dragon Quest</em> game.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/cgb-bd3e/cgb-bd3e-3.png\" width=\"700\" height=\"700\" alt=\"Picture\" /></figure>\n\n<p>It has an aggressive pose, menacingly moving towards you. It looks like a cell from an animated film. Compare that with Amano Yoshitaka’s golem from the first <em>Final Fantasy</em>.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/cgb-bd3e/cgb-bd3e-4.png\" width=\"371\" height=\"447\" alt=\"Picture\" /></figure>\n\n<p>It’s not as simple, not as iconic. You won’t find this drawing on a shirt. To be fair, I don’t think Yoshitaka had the same intention; he seems focused on making menacing monsters, readability be damned. The complicated relationship between Yoshitaka and the pixel artist for Square, Shibuya Kazuko (she often made pixel art of characters before the drawings were even made), doesn’t help consistency either. Which reinforces my point that Toriyama’s art style and methods are better suited to the Famicom’s limitations.</p>\n\n<p>I’m talking about the Famicom here because the game was originally released on that system in February 1988. Subsequently released in the US on NES in March 1992, the game is what elevated the series to its revered status in Japan. It has a four-character party, with custom-built characters and an interesting list of job options, a simple class system, and a massive world to explore. For its time, it was a tour de force that such a complicated set of features was offered in an accessible package. Other RPGs of the era were often mean with their difficulty and obtuse with their explanations. The <em>Dragon Quest</em> games succeeded because they took pride in providing a game that was never punishing; failing at the game only ever meant losing half your gold and being transported back to your last save location. You never lose your hard-earned experience points and you’re never forced to reload a save. Because of its ease of use and lack of punishment, it’s a perfect RPG for an old curmudgeon like me who feels an urge to foolishly stay stuck in the past.</p>\n\n<h2 id=\"a-super-famicom-game-in-your-pocket\">A Super Famicom Game in Your Pocket</h2>\n\n<p>The game was brought to Game Boy Color in 2001, but it wasn’t the first time the game was remade for another system. In 1993, the company Heart Beat entered the fray as the new supporting developers of Dragon Quest titles, starting with a remake of <em>Dragon Quest III</em> on Super Famicom. To understand the importance of that detail, we need to step back and look at the development history of the series. The Dragon Quest games have a unique development structure; the trio of Horii Yuji, Toriyama Akira, and Sugiyama Koichi are responsible for their specific tasks, but the brunt of the development is done by a contracted company, initially Chunsoft. Enix (now Square Enix) ultimately publishes the games in Japan. By the time the Super Famicom became the home of the series, Chunsoft’s titles were underwhelming in many ways. The graphics were dated but more than that the user interface and speed of the games felt stuck in the past; they felt like old Famicom games. Their titles sold well, and <em>Dragon Quest V</em> is widely regarded as a masterpiece, but it’s clear that the trio of Yuji, Akira and Koichi wanted something better. So Chunsoft was given the boot, and Heart Beat took over their role as the company developing the games. <em>Dragon Quest III</em> on Super Famicom is the first title made by this team of developers, and I think they blew it out of the park. They lavished a ton of effort and cut no corner. Their most impressive work is undoubtedly the full attack animations for every single enemy of the game.</p>\n\n<p>It’s exquisite work, seemingly drawn by a team of artists at ArtePiazza. Heart Beat introduced new dungeons to explore once you have beaten the game, along with a fun new class, the Thief, and other less successful gameplay additions we’ll broach later. It’s a masterclass in how to improve on a previously released title, and the crazy thing with the 2001 release on Game Boy Color is that every element of the Super Famicom game was brought over to the portable title, even the intricate enemy attack animations. Those animations are beautiful on Super Famicom, but they’re a notch above on Game Boy Color for the mere fact that they’re there. They took the time to redraw each and everyone of them for this Game Boy Color port.</p>\n\n<p>I can think of no other GBC game with such smooth animation. We have TOSE, the shadowy developer, to thank for this Game Boy Color <em>tour de force</em>. It must have been a monumental job to redraw so many things to fit within the colour constraints of the diminutive console, and to bring over all those animations.</p>\n\n<h2 id=\"my-personal-connection\">My Personal Connection</h2>\n\n<p>I didn’t know about any of those details when I bought the game. What had convinced me to buy it was the poster for Nintendo Power 144, one of the first issues I read when I first subscribed to the magazine. I wanted to learn more about the upcoming Game Boy Advance and my English-reading abilities were now good enough to read a game magazine by then. The poster features the cover art for the box and cartridge, a beautiful Toriyama Akira drawing, but what ultimately drew me in were all the details about the game on the back of the poster.</p>\n\n<div class=\"gallery\">\n<div class=\"gallery_element\"><figure class=\"figure figure_art gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bd3e/cgb-bd3e-5.jpg\" width=\"1183\" height=\"1568\" alt=\"Picture\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_art gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bd3e/cgb-bd3e-6.jpg\" width=\"1134\" height=\"1569\" alt=\"Picture\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_art gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bd3e/cgb-bd3e-7.jpg\" width=\"1114\" height=\"1569\" alt=\"Picture\" /></figure></div>\n<div class=\"gallery_element\"><figure class=\"figure figure_art gallery\"><img class=\"figure_img\" src=\"/assets/cgb-bd3e/cgb-bd3e-8.jpg\" width=\"1096\" height=\"1571\" alt=\"Picture\" /></figure></div>\n</div>\n\n<p>It’s nothing more than an ad in the form of a daily journal, but I was hooked and wanted to buy the game, even though the Game Boy Advance was out by this point and I could have spent my hard-earned money on more impressive games. However, there was a problem. The only store near me that sold games, my local Zellers, did not have the game when I went there following its July release. Perhaps the Sears catalogue would carry it come the Christmas season; with the Game Boy Advance now released, I knew this was a long shot. My only chance to buy the game was seemingly gone.</p>\n\n<p>But by 2001, a new online store had opened, available for any resourceful 15-year old. I borrowed my parent’s credit card after much pleading, and I ordered from a new website, recently available in Canada, offering an incredible selection of merchandise and affordable shipping: amazon.ca. I do not have my order in my account anymore (I changed my Amazon account in 2004 for some reason), but <em>Dragon Warrior III</em> was my first online purchase, way back in the prehistoric era of 2001. I still remember going to my neighbourhood’s community mailbox, and the excitement I felt at finally seeing the packages key in our family’s little mailbox. Opening the package was exhilarating. A delivery from the internet. How unique! I immediately enjoyed its introduction (particularly the battle between Ortega and the dragon, which feels like a Dragon Ball combat sequence), its previously mentioned colour palette, and the blazing fast walking speed. Oh man that walking speed is so sweet. You just zip through every screen at what feels like the speed of light, and I feel so grateful to the developers of the Super Famicom reissue for doing that, and for TOSE for bringing it to their Game Boy Color version. The developers valued your time, and don’t want you to waste any time uselessly. I begrudge any RPG without a quick walking speed because of this specific game.</p>\n\n<p>Once I had built a party, an interesting prospect since you’re forced to make heartbreaking class choices, you start exploring the world and discover the previously mentioned enemy animations, and the day and night cycle. It feels like nothing special, but the fact that TOSE managed to keep the Game Boy screen readable while conveying nighttime is a small feat in itself. Unfortunately, the second world map you explore much later is always in nighttime, and that’s a bummer. You don’t get to enjoy the beautiful day palette.</p>\n\n<p>The game is great but not everything added with the Super Famicom reissue is perfect. I particularly take umbrage at the personality system. The initial test for your hero character’s personality is fun (particularly the unique final scenario to evaluate your reactions to a specific situation), but personalities’ numerical impact is never explained. Here’s the down-low: each personality impacts stat growth at level-up in positive or negative ways. You can gather books throughout the game to change your character’s personalities, but I would have preferred if the game was clear about what each personality did, especially since they are not equal. Two or three specific personalities are clearly better out of a large set of mostly inconsequential stuff. As it stands, nothing tells you if the personalities you find are improvements from what you have.</p>\n\n<p>They also added Tiny Medals, unique hidden collectibles you can find and trade for increasingly better rewards. Since there is no way to precisely track which medal you already found, it can quickly become tedious to retrace your steps to look for medals you might have missed. Fortunately, you don’t need every single medal to get all the rewards, and the Thief class has two spells to alleviate your quest for the JRPG equivalent of loose change hidden between the sofa cushions.</p>\n\n<h2 id=\"not-hard\">Not Hard</h2>\n\n<p>Dragon Quest games have never been hard; since the very first title the consequence for dying is merely losing half your money and being sent back to your last save location. Another gameplay element has defined the series: Magic Points are only restored by staying at an inn except for some rare exceptions. These two core concepts make the series favour attrition over any other sort of challenge. It’s about your party’s ability to reach the end of the dungeon before they run out of magic points, not about the particular challenge of each battle. This makes the adventure soothing and fun for me. I like playing a game to see how deep inside a cavern you can go all while searching for treasure. Not every game needs to be a tense gauntlet like <em>Dark Souls</em>.</p>\n\n<p>So <em>Dragon Quest III</em> is really fun to passively explore as a kind of way to keep your hands busy while you relax. As a big bonus to the exploration fun the world map is patterned after the real world; you start on an island that doesn’t exist but then you get teleported to fake Italy and go from there. That way it’s always fun to figure out where you are compared to the real world, and what hall of mirrors parody of a nation you’ll encounter next.</p>\n\n<p>Once you enter a dungeon though you’re on your own. The game only offers a world map; you get no such luxury anywhere else. This could be a big turn off for many people, and I completely agree if you don’t want to play an RPG that doesn’t have dungeon maps, especially if it has the small viewable area of the Game Boy Color. However, the absence of a map is not always a nonstarter; great developers will adapt their design to present a cohesive map that players can learn. <em>Dragon Quest III</em>, for the most part, offers simple dungeons that won’t be too hard to understand. Since you won’t have the crutch of a map to rely on you’ll also learn and retain the structures of the game. After twenty years of playing, I instinctively know all the towers and caverns of the game <em>because</em> there isn’t a map.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>I’ll still be playing <em>Dragon Quest III</em> when I’m 80 years old, and I’ll play it on Game Boy Color like god intended. The mobile versions have terrible redrawn sprites and all sorts of poor artistic choices. Please do me a favour and stay away. I also cannot wrap my head around playing that game tethered to a television. I want to put on a podcast and relax in my sunroom with the game in my hands, the dog at my feet, and my wife next to me. That’s my definition of heaven.</p>\n"},{"id":"dmg-wa","date_published":"2021-01-16T00:00:00-05:00","url":"https://gameboyessentials.com/articles/dmg-wa","title":"Wave Race","image":"/assets/dmg-wa/dmg-wa-start.png","banner-image":"/assets/dmg-wa/dmg-wa-start-social-share-card.png","content_html":"<h1 id=\"wave-race\">Wave Race</h1>\n\n<ul>\n  <li>Released in North America in July 1992</li>\n  <li>Released in Europe in June 1997</li>\n  <li>Never released in Japan</li>\n  <li>Published by Nintendo</li>\n  <li>Developed by Pax Softnica &amp; Nintendo EAD</li>\n</ul>\n\n<figure class=\"figure figure_boxart\"><img class=\"figure_img\" src=\"/assets/dmg-wa/dmg-wa-1.jpg\" width=\"800\" height=\"790\" alt=\"Boxart\" /><figcaption class=\"figure_figcaption\">The neon colours and faux 3D screams early 90s. Radical, dude!</figcaption></figure>\n\n<h2 id=\"the-wunderkind-is-here\">The Wunderkind Is Here</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/dmg-wa/dmg-wa-2.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>In 1992, Shigeru Miyamoto made his first Game Boy game with <em>Wave Race</em>. This is important, not because <em>Wave Race</em> is this extraordinary game; it’s actually quite ordinary. It’s important because it’s the only time Miyamoto joined a party late. Outside of <em>Wave Race</em>, Miyamoto has been front and centre on day one with a marquee title that helps define a new system (<em>Donkey Kong</em> on Famicom, <em>Super Mario World</em>, <em>Super Mario 64</em>, <em>Super Mario Advance</em>, <em>Luigi’s Mansion</em>). For the other exception, the Virtual Boy, he stayed completely away from that console and so never joined the party at all, and <a href=\"https://www.nintendo.co.uk/Iwata-Asks/Iwata-Asks-Nintendo-3DS/Vol-1-And-That-s-How-the-Nintendo-3DS-Was-Made/2-Shigeru-Miyamoto-Talks-Virtual-Boy/2-Shigeru-Miyamoto-Talks-Virtual-Boy-229419.html\">he described the Virtual Boy as a toy, not a console</a>.</p>\n\n<p>With <em>Wave Race</em>, Miyamoto was riding in the wake of other developers instead of making the waves himself. It is a unique opportunity to see how Miyamoto works when he’s not directly collaborating with the hardware designers during the development of a console. That undeniably makes <em>Wave Race</em> essential.</p>\n\n<h2 id=\"conjecture\">Conjecture</h2>\n\n<figure class=\"figure figure_gb float right\"><img class=\"figure_img\" src=\"/assets/dmg-wa/dmg-wa-3.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>Why did Miyamoto start designing games for the Game Boy so late? We have no exact idea, but looking at where the Game Boy stood around 1992, we can mount a reasonable theory. With Yokoi’s R&amp;D1 hard at work on project VR32, which will ultimately become the Virtual Boy, their output on Game Boy was reduced to one game a year. Hiroshi Yamauchi, Nintendo’s fearless CEO, probably decided that this was not enough games to sustain the momentum of their most successful system. Miyamoto was then asked to develop games for it, with a third-party company assigned to work with him: <a href=\"https://www.giantbomb.com/pax-softonica/3010-5009/\">Pax Softnica</a>. This is the same structure that was used for the development of <a href=\"/articles/dmg-ka\"><em>Kid Icarus: Of Myths and Monsters</em></a>, with one Nintendo employee, Masafumi Sakashita, supported by employees from a contracted company. Does Miyamoto’s collaborative effort compare favourably to Sakashita’s efforts? Yes, but both games do vastly different things.</p>\n\n<h2 id=\"retrogaming-in-1992\">Retrogaming in 1992</h2>\n\n<figure class=\"figure figure_gb float left\"><img class=\"figure_img\" src=\"/assets/dmg-wa/dmg-wa-4.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>The most important difference between <em>Kid Icarus</em> and <em>Wave Race</em> is that Miyamoto made a backwards-looking title. The most interesting 1992 Game Boy titles are more involved experiences than this jet ski racing game. It feels more like a 1990 Game Boy title. I would have expected something with far more configurability, or with a great personality. <em>Super Mario Kart</em>, in a sense. Instead, the game is limited in a way that makes me feel like Miyamoto was aping R&amp;D1’s style. At first glance, <em>Wave Race</em> looks like a different interpretation of <em>F1 Race</em>, the inaugural four-player adapter title. You don’t see any charming interactions, with the game sticking close to its subject matter. The game has a save feature, but only to keep track of your time records and to tell which engine class championships you have unlocked. With the championships forcing you to redo all the races of the previous classes, this makes the game more repetitive than it ought to. Think about it, this means that whatever selection you make, you will always have to start with the same race. It’s as if a Mario Kart championship always started with the same exact race. There are two types of circuits, however, which greatly helps to shake things up. You have a racing circuit, but also a point-chasing game, where you have to go through gates to gather points. The caveat is that each gate only gives point to the first player to go through. This means you have to chase different routes than your adversaries. It’s neat, and I’m wondering if this is a racing style that exists in real life.</p>\n\n<p>All in all, the game is simple, but there is that element of Miyamoto magic present, this tireless focus on core gameplay that I love so much about him.</p>\n\n<h2 id=\"the-miyamoto-touch\">The Miyamoto Touch</h2>\n\n<figure class=\"figure figure_gb float right\"><img class=\"figure_img\" src=\"/assets/dmg-wa/dmg-wa-5.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n<p>I’ve previously discussed racing games with other perspectives, but this is our first top-down racing game. <em>Wave Race</em> uses a top-down perspective with directional, instead of <em>tank</em>, controls. It’s very well done, with everything you need to help you succeed despite the limited point of view and constant scrolling action. You have a map with dots for the racers, helpful ranking numbers right next to your character so you don’t have to spend a moment looking away from the centre of the screen. It’s a busy game for the slow screen of the original Game Boy, but it does not become impossible to see; you can always see what’s happening. It does that by using very clean, repeating patterns for the water you race on. Even though things are blurry, the repeating pattern helps your brain make sense of the blur.</p>\n\n<p>Racing on water means you can’t brake; the game uses this simple fact as the core gameplay hook of the whole game. Can you manage tight turns without brakes? The manual informs you that the best turning method is to let go of the gas as you enter the turn, use momentum to rotate your vehicle and then hit the boost right as you exit the turn to sharpen your angle. It’s fun to do. You also have to be careful to make sure you have enough boosting power for each turn, since it regenerates very slowly.</p>\n\n<figure class=\"figure figure_gb\"><img class=\"figure_img\" src=\"/assets/dmg-wa/dmg-wa-6.png\" width=\"160\" height=\"144\" alt=\"Game Boy Screenshot\" /></figure>\n\n<p>I like the conceit of the slowly regenerating boost. It starts every race empty, and you really have to manage it. I think it’s there because your throttle is digital, and that meant that there’s no way to represent a rev-up during a turn to push your jet ski closer to the turn. By using a boost that you hit with the second button, you can mimic this precise throttling action. For a game with such a heavy focus on precise arcade-style racing, power-ups would be an unconventional addition. Surprisingly, the game has two special items, represented by animals, that give you a temporary special power. But those upgrades, coupled with the funky hazards peppered throughout the race, are to me an expression of Miyamoto’s design philosophy. They make the game interesting at all times. You are never simply running in a direction, doing nothing but pressing a button. You are constantly distracted, pushed and pulled in different directions. It’s never boring.</p>\n\n<p>The final element that keeps the game exciting at all times is the AI. It is reasonably good. They ram you when you get too close, they step in front of you to deny passage, they steal the special items, and they pull ahead of you and do not wait around if you make too many mistakes. I know they’re controlled by very simple logic, but time and effort were clearly spent to make them interesting. I can clearly see that Miyamoto sweat over their reactions.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Until the reorganization of Nintendo divisions in 2003, Miyamoto was in the trenches developing games through the management of his own division, Nintendo EAD. Sweating over AI racers in Game Boy games. After 2003, Miyamoto took a gradual step away from managing a team, and he became this kind of internal consultant, able to provide input to his cadre of protégés who are themselves responsible for the overall management of all of Nintendo’s teams. This has made him the most senior artisan in the company, supporting every single project at the company with his insights. When Nintendo CEO Satoru Iwata suddenly died in 2015, Miyamoto even rose to the position of interim co-CEO with Genyo Takeda during the search for a replacement. The father of Mario oversaw the whole gosh darn company for years. Miyamoto is without any doubt the person with the largest impact on the company.</p>\n\n<p>With <em>Wave Race</em>, we have this artifact from a time where Nintendo’s most important executive wasn’t supervising the whole company’s output, and instead had to design a small game for a console he didn’t help to create. What an interesting legacy for such a low-key game.</p>\n\n<figure class=\"figure figure_art\"><img class=\"figure_img\" src=\"/assets/dmg-wa/dmg-wa-7.jpg\" width=\"640\" height=\"473\" alt=\"Picture\" /><figcaption class=\"figure_figcaption\">Sold in the United Kingdom, this set included a Game Boy Pocket and two games, <em>Wave Race</em> and <em>Metroid II: Return of Samus</em>.</figcaption></figure>\n"}]}